[{"album":null,"lyrics":null,"title":null,"year":null},{"album":null,"lyrics":null,"title":null,"year":null},{"album":"late_registration","lyrics":"I gotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'mma touch the sky\nGotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'mma touch the sky\n\nBack when they thought pink Polos would hurt the Roc\nBefore Cam got the shit to pop, the doors was closed\nI felt like Bad Boy's street team, I couldn't work the LOX\nNow let's go, take 'em back to the plan\nMe and my momma hopped in that U-Haul van\nAny pessimists I ain't talk to them\nPlus I ain't have no phone in my apart-a-ment\nLet's take 'em back to the club\nLeast about an hour I stand on line, I just wanted to dance\nI went to Jacob an hour after I got my advance, I just wanted to shine\nJay favorite line, \"Dawg, in due time\"\nNow he look at me, like, \"Damn, dawg, you where I am\"\nA hip hop legend, I think I died\nIn that accident, 'cause this must be heaven\n\nI gotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'm a touch the sky\nGotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'mma touch the sky\n\nNow let's take 'em high-igh-igh-igh-igh-igh la la la la la la la\n(Top of the world, baby, top top of the world)\n(Top of the world, baby, on top of the world)\nNow let's take 'em high-igh-igh-igh-igh-igh la la la la la la la\n(Top of the world, baby, top top of the world)\n(Top of the world, baby, on top of the world) Uh\n\nBack when Gucci was the shit to rock\nBack when Slick Rick got the shit to pop\nI'd do anything to say I got it\nDamn, them new loafers hurt my pocket\nBefore anybody wanted K. West beats, me and my girl split the buffet at KFC\nDog, I was having nervous breakdowns like, \"Man, these niggas that much better than me?\"\nBaby, I'm going on an aeroplane and I don't know if I'll be back again\nSure enough, I sent the plane tickets but when she came to kick it, things became different\nAny girl I cheated on, sheets I skeeted on\nCouldn't keep it at home, thought I needed a Nia Long\nI'm trying to right my wrongs but it's funny them same wrongs helped me write this song, now\n\nI gotta testify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\nYou gonna touch the sky baby girl\nTestify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\n\n\nYes, yes, yes\nGuess who's on third?\nLupe steal like Lupin the 3rd\nHere like ear till I'm beer on the curb\nPeach fuzz buzz but beard on the verge\nLet's slow it down like we're on the syrup\nBottle shaped body like Mrs. Butterworth\nBut, before you say another word\nI'm back on the block like I'm laying on the street\nI'm trying to stop lion like I'm Mumm-Ra\nBut I'm not lyin' when I'm laying on the beat\nEn garde, or touché, Lupe cool as the unthawed\nBut I still feel possessed as a gun charge\nCome as correct as a porn star\nIn a fresh pair steps in my best foreign car\nSo, I represent the first\nNow let me end my verse right where the horns are like uh\n\n\nI gotta testify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\nYou gonna touch the sky baby girl\nTestify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\n\nWe back at home, baby\nSky high\nI'm, I'm sky high\nI'm, I'm sky high\nI'm, I'm sky high\nI'm, I'm sky high\nI'm, I'm sky high\nSky, uh, sky high\nI'm, I'm sky high\n\nYeah\nKeep it rollin'\nYeah\nUh, feels good to be home, baby\nFeels good to be home","title":"touch_the_sky"},{"album":"late_registration","lyrics":"She take my money when I'm in need\nYeah she's a triflin' friend indeed\nOh, she's a gold digger, way over town\nThat digs on me\n\n\nNow I ain't sayin' she a gold digger\n\nBut she ain't messin' wit' no broke niggas\n\n\nNow I ain't sayin' she a gold digger\n\nBut she ain't messin' wit' no broke niggas\n\n Get down girl, go 'head get down\n Get down girl, go 'head get down\n Get down girl, go 'head get down\n Get down girl, go 'head\n\nCutie the bomb, met her at a beauty salon\nWith a baby Louis Vuitton under her underarm\nShe said, I can tell you rock, I can tell by your charm\nFar as girls you got a flock, I can tell by your charm\n\nAnd your arm, but I'm lookin' for the one. Have you seen her?\nMy psychic told me she'll have an ass like Serena\nTrina, Jeena-fah Lopez, four kids\nAnd I gotta take all they bad ass to ShowBiz\n\nOkay, get your kids, but then they got their friends\nI pulled up in the Benz, they all got up in\nWe all went to din and then I had to pay\nIf you fuckin' with this girl then you better be paid\n\nYou know why? It take too much to touch her\nFrom what I heard she got a baby by Busta\nMy best friend said she used to fuck with Usher\nI don't care what none of y'all say, I still love her\n\n\nNow I ain't sayin' she a gold digger, uh\n\nBut she ain't messin' wit' no broke niggas, uh\n\n\nNow I ain't sayin' she a gold digger, uh\n\nBut she ain't messin' wit' no broke niggas, uh\n\n Get down girl, go 'head get down\n Get down girl, go 'head get down\n Get down girl, go 'head get down\n Get down girl, go 'head\n\nEighteen years, eighteen years\nShe got one of yo' kids, got you for eighteen years\nI know somebody payin' child support for one of his kids\nHis baby mama car and crib is bigger than his\n\nYou will see him on TV, any given Sunday\nWin the Super Bowl and drive off in a Hyundai\nShe was supposed to buy your shorty Tyco with your money\nShe went to the doctor got lipo with your money\n\nShe walkin' around lookin' like Michael with your money\nShould've got that insured, GEICO for your money \nIf you ain't no punk\nHolla we want prenup (We want prenup!)\n\nYeah, it's something that you need to have\n'Cause when she leave your ass she gon' leave with half\nEighteen years, eighteen years\nAnd on her eighteenth birthday, he found out it wasn't his\n\n\nNow I ain't sayin' she a gold digger, uh\n\nBut she ain't messin' wit' no broke niggas, uh\n\n\nNow I ain't sayin' she a gold digger, uh\n\nBut she ain't messin' wit' no broke niggas, uh\n\n Get down girl, go 'head get down, uh\n Get down girl, go 'head get down\n Get down girl, go 'head get down, uh\n Get down girl, go 'head\n\nNow I ain't sayin' you a gold digger, you got needs\nYou don't want a dude to smoke but he can't buy weed\nYou got out to eat and he can't pay, y'all can't leave\nThere's dishes in the back, he gotta roll up his sleeves\n\nBut while y'all washin', watch him\nHe gon' make it into a Benz out of that Datsun\nHe got that ambition, baby, look at his eyes\nThis week he moppin' floors, next week it's the fries\n\nSo, stick by his side\nI know there's dude's ballin', but yeah that's nice\nAnd they gon' keep callin' and tryin', but you stay right, girl\nAnd when you get on, he leave yo' ass for a white girl\n\n Get down girl, go 'head get down\n Get down girl, go 'head get down\n Get down girl, go 'head get down\n Get down girl, go 'head","title":"gold_digger"},{"album":null,"lyrics":null,"title":null,"year":null},{"album":"late_registration","lyrics":"Drive slow, homie\nDrive slow, homie\nYou never know, homie, might meet some hoes, homie\nYou need to pump your brakes and drive slow, homie\n\nMy homie Marley used to stay 79th and May\nOne of my best friends from back in the day\nDown the street from Calumet, a school for the Stones\nHe nicknamed me K-Rock so they would leave me alone\nBulls jacket with his hat broke way off\nAnd walked around the mall with his radio face off\nPlus he had the spinner from his Daytons in his hand\nKeys in his hand, reason again to let you know he's the man\nBack when we rocked Ellesses, he had dreams of Caprices\nDrove by the teachers, even more by polices\nHow'd he get the cash? The day his father passed away\nLeft him with a little somethin, sixteen he was stuntin'\nAl B. Sure nigga with the hair all wavy\nHit Lake Shore, girls go all crazy\nHit the freeway, go at least 'bout eighty\nBoned so much that summer, even had him a baby\nSee back-back then-then, if you had a car\nYou was the Chi-Town version of Baby\nAnd I was just a virgin, a baby\nOne of the reasons I looked up to him crazy\nI used to love to play my demo tape when the system yanked\nFelt like I was almost signed when the shit got cranked\nWe'd take a Saturday and just circle the mall\nThey had they Lincolns and Auroras, we was hurtin 'em all\nWith the girls a lot of flirtin' involved, but dog\nFuck all that flirtin', I'm tryin' to get in some drawers\nSo put me on with these hoes, homie\nHe told me don't rush to get grown, drive slow, homie\n\nDrive slow, homie\nDrive slow\nYou never know, homie, might meet some hoes, homie\nYou need to pump your brakes and drive slow, homie\n\n\nWhat it do? I'm posted up in the parking lot, my trunk waving\nThe candy gloss is immaculate, it's simply amazing\nThem elbows pokin' wide on that candy 'Lac\nTrunk open, screens on, neons lit with fifth relaxed\nI'm on a mission for dime-pieces and sexy ladies\nAllow me to introduce you to my CL Mercedes\nIt's a star-studded event when I valet park\nOpen up my mouth and sunlight illuminates the dark\nYou see them fours crawling? You see them screens falling?\nThe disco ball in my mouth insinuates I'm ballin'\nI'm leaning on the switch, sitting crooked in my slab\nBut I could still catch boppers if I drove a cab\nA young Houston hard hitter all about the scrilla\nRidin' something candy coated, crawling like a caterpillar\nI'm tipping on them fours, I'm jamming on that Screw\nI'm looking for them hoes, baby, what it do? Drive slow, homie\n\n\nTurn your hazard lights of when you see them hoes (Drive slow, homie)\nIf you're riding around the city with nowhere to go (Drive slow, homie)\nLive today, 'cause tomorrow, man, you never know\n(You never know, homie, might meet some hoes, homie\nYou need to pump your brakes and drive slow, homie)\n\n(My car's like the movie, my car's like the crib\nI got more TVs in here than where I live)\nAnd that don't make no sense, but baby, I'm the shit\nAnd everything I flip, you know it's something serious\nI got the custom grill, I got the Brabus rims\nI got the baller genetics, baby, this evidence\nYou see a player flicking, and how you ain't convinced\nThat you should go on and kiss it, just a little bit (Just a little bit)\nI got my custom kicks, I got my Jesus chain\nMy canaries is gleamin' through my angel wings\nThey see me, hoes actin like they seen a king\nWith that mean lean, smoking on that finest Cali green\nMy woodgrain oak, I'm ridin on Vogues\nMy cylinder quiet, like tip-toes\nI sold O's, and this I know\nWhen you see them hoes, little homie, drive slow\n\n\nYeah, drive slow, homie\nDrive slow, homie\nYou never know, homie, might meet some hoes, homie\nYou need to pump your brakes and drive slow, homie\nDrive slow, homie","title":"drive_slow"},{"album":"late_registration","lyrics":"Yeah\n(I'm on way home)\n\n\nThey say home is where the hate is, my dome is where fate is\nI stroll where souls get lost like Vegas\nSeen through the eyes of rebel glasses\nPray to God that my arms reach the masses\nThe young smoke grass in grassless jungles\nRubber band together in cashless bundles\nWe wear strugglin' chains, divided only hustle remains\nMakin' sense of it, we hustle for change\nRevolution ain't a game it's another name for life fightin'\nSomeone to stay in they corner like Mike Tyson\nHypes fightin' for hits to heighten they hell\nDon't he know he could only get as high as he fell?\nShow money becomes bail, relationships become jail\nChildren are unheld, I wish love was for sale\nBehold the pale horse got me trapped like R. Kell, I bail and it\n\n\nMight not be such a bad idea if I never, never went home again\nI'm on my way home\nI left three days ago, but no one seems to know I'm gone\nHome is where the hatred is\nHome is filled with pain and it\nMight not be such a bad idea if I never, never went home again","title":"my_way_home"},{"album":"late_registration","lyrics":"That's that crack music nigga\nThat real black music nigga\n\n(That's that crack music nigga\nThat real black music nigga)\n\n\nHow we stop the Black Panthers?\nRonald Reagan cooked up an answer\nYou hear that? What Gil Scott was hearing\nWhen our heroes or heroines got hooked on heroin\nCrack raised the murder rate in D.C. and Maryland\nWe invested in that, it's like we got Merrill lynched\nAnd we been hangin' from the same tree ever since\nSometimes I feel the music is the only medicine\nSo we, cook it, cut it, measure it, bag it sell it\nThe fiends cop it, nowadays they can't tell if\nThat's that good shit, we ain't sure man\nPut the CD on your tongue, yeah that's pure man\n\n\nThat's that crack music nigga\nThat real black music nigga\n\n(That's that crack music nigga\nThat real black music nigga)\n\n\nFrom the place where the father's gone, the mothers is hardly home\nAnd the madigon's lock us up in the Audy Home\nHow the Mexicans say, we just tryin' to party holmes\nThey wanna pack us all in a box like styrofoam\nWho gave Saddam anthrax?\nGeorge Bush got the answers\nBack in the hood, it's a different type of chemical\nArm & Hammer baking soda raised they own quota\nRight when our soldiers, ran for the stove 'cause\n'Cause, dreams of being Hova\nWent from bein' a broke man to bein' a dopeman\nTo bein' the President, look there's hope man\nThis that inspiration for the Moes and the Folks man\nShorty come and see his momma straight overdosin'\nAnd this is the soundtrack\nThis the type of music that you make when you 'round that\n\n\nCrack music nigga\nThat real black music nigga\n\n(That's that crack music nigga\nThat real black music nigga)\n\n\nGod, how could you let this happen?\nHappen, happen\nHappen, happen\nHappen\n\n\nUh, that's that crack music, crack music\nThat real black music, black music\n\n(That's that crack music nigga\nThat real black music nigga)\n\n\nThat's that crack music, crack music\nThat real black music, black music\n\n\nOur Father, give us this day, our daily bread\nBefore the feds give us these days and take our daily bread\nSee I done did all this ol' bullshit\nAnd to atone, I throw a little somethin' somethin' on the pulpit\nWe took that shit, measured it and then cooked that shit\nAnd what we gave back was crack music\nAnd now we ooze it through they nooks and crannies\nSo our mamas ain't got to be they cooks and nannies\nAnd we gon' repo everything they ever took from granny\nNow the former slaves trade hooks for Grammys\nThis dark diction has become America's addiction\nThose who ain't even black use it\nWe gon' keep baggin' up this here crack music","title":"crack_music"},{"album":"late_registration","lyrics":"I know it's past visiting hours but can I please give her these flowers?\nThe doctor don't wanna take procedures, he claim her heart can't take the anaesthesia\nIt'll send her body into a seizure, that little thing by the hospital bed, it'll stop beepin'\nHey chick, I'm at a loss for words\nWhat do you say at this time, \"Remember when I was nine?\"\nTell her everything gon' be fine, but I be lyin'\nHer family cryin', they want her to live, and she tryin'\nI'm arguin like, \"What kind of doctor can we fly in?\"\nYou know the best medicine go to people that's paid\nIf Magic Johnson got a cure for AIDS and all the broke motherfuckers passed away\nYou telling me if my grandma's in the NBA, right now she'd be okay?\nBut since she was just a secretary, worked for the church for thirty-five years\nThings supposed to stop right here, my grandfather tryin to pull it together, he's strong\nThat's where I get my confidence from\nI asked the nurse, \"Did you do the research?\"\nShe asked me, \"Can you sign some T-shirts?\"\nBitch, is you smokin' reefer?\nYou don't see that we hurt? But still\n\n\nI smile when Rosie comes to see me\nAnd I can't wait for a sunny day (Seeing it through your eyes)\nCan't wait for the clouds to break\n\n\nThey outside of the emergency room, room, you can feel my heartbeat, beat, beat\nIf she gon' pull through, we gon' find out soon but right now she asleep, sleep, sleep\nMy mama say they say she could pass away anyday\nHey chick, what these doctors know anyway?\nLet me see the X-rays, I ain't no expert, I'm just hurt\nCousin Kim took off of work\nPlus my Aunt Shirley, Aunt Beverly, Aunt Clay, and Aunt Jean\nSo many aunties we could have an auntie team\nFeel like Amerie, it's just one thing when they said that she made it you see they eyes gleam\nI think we at a all-time high to get there, we run, we fly, we drive\n'Cause with my family we know where home is so instead of sending flowers, we're the roses\n\n\nI smile when Rosie comes to see me\nAnd I can't wait for a sunny day (Seeing it through your eyes)\nCan't wait for the clouds to break\nOh, Rosie brings the sunshine, oh\n\nI smile when roses comes to see me\nAnd I can't wait for a sunny day (Seeing it through your eyes)\nCan't wait for the clouds to break\n\n\nI smile when Rosie come to see me\nAnd I'm sad, when Rosie goes away\nOh Rosie brings the sunshine (Say)\n\n\nCan't wait, I can't wait, no\nCan't wait, I can't wait, no\nCan't wait, I, can't wait\nNo, can't wait, for, for a sunny day\nMomma can't wait for the clouds to break\nMm mmm mm mm-mm mm-mm\nOh, oh, oh, oh, no, no, say\nTellin' you the truth now\nSaid I can't wait, uh-uh\nI won't wait, no","title":"roses"},{"album":"late_registration","lyrics":"I always knew that one day, they'd try to bring me down, way down, way down\nOne day, they'd tried to bring me down\nAlways knew that one day, they'd try to bring me down\nWay down, they'd try to bring me down\n\n\nWe gon' to Mass today, we have to pray\nBesides what the pastor say, I have to say since Pac passed away\nMost you rappers don't even deserve a track from me\nYou see, if you ever wanted to ever be anything\nThere'd always be somebody that shoot down any dream\nThere'll always be haters, that's the way it is\nHater niggas marry hater bitches and have hater kids\nBut they gon' have to take my life 'fore they take my drive\n'Cause when I was barely livin', that's what kept me alive\nJust the thought that maybe it could be better than what we at at this time\nMake it out of this grind, 'fore I'm out of my mind\nAnd get some leeway on the he say she say\nYour girl don't like me, how long has she been gay?\nSpanish girls say, \"Yo, no hablo inglés\"\nAnd everybody want to run to me for their single\nIt's funny how these wack niggas need my help\nWasn't around when I couldn't feed myself\nDawg, if I was you, I wouldn't feel myself\nDawg, if I was you, I'd kill myself\nMade a mil' myself and I'm still myself\nAnd I'mma look in the mirror if I need some help\nNow I'll speak from the heart, y'all all frontin'\nEverybody feel a way about K but at least y'all feel something\n\n\nWhy'd you come then?\nI bet only for getting what some get would get ya\nWhat kinda dream we found?\nSee I'm often at your crossways\nForgetting where the hell I met ya\nAnd try to bring me down\n\nI always knew that one day, they'd try to bring me down, way down, way down\nAlways knew that one day, they'd try to bring me down\nAlways knew that one day, they'd try to bring me down\nWay down, they'd try to bring me down","title":"bring_me_down"},{"album":"late_registration","lyrics":"You make me smile in my heart, oh\n\n\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut (You make me smile)\n\n\nWhat's your addiction? Is it money? Is it girls? Is it weed?\nI've been afflicted by not one, not two, but all three\nShe's got the same thing, about me, but more, about us\nShe's coming over, so I guess, that means, I'm her drugs\nJust let me peek now, I mean damn, I'm so curious\nShe's got a lover, so the lies, and the lust, is a rush\nTime's of the essence, I need, you to be spontaneous\nRoll up the doja, Henny and Coca-Cola\nThen I'm co coming over 'cause it's never over\n\n\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut (You make me smile)\n\n\nI see the emotion in your eyes, that you, try not to show\nWe get the closest when you high, or you drunk, or you blown\nSo I pour the potion, so we could both get high, as we could go\nThen I'll get the lotion, and do somethin' to me, when your thighs is exposed\nThere's no turning back now, I mean I don't mean to impose\nNot now but right now, I need you to undress, and then pose\nI'm into that now, catch a vibe, when the doors, get closed\nRoll up the doja, Henny and Coca Cola\nAnd I keep co coming over 'cause it's never over\n\n\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut (You make me smile)\n\n\nYou make me smile\nYou make me smile with my heart, oh\n\n\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut (You make me smile with my heart)\n\n\nI just wanted to ask you\nJust wanted to um, let me, how would I put this uh\nLet's say all your friends, remember the one\nYou said if you ever she would be the one\nOK, OK, OK (You make me smile with my heart, oh)\nI was thinking, hypothetically\nI mean don't take this seriously\nDon't take me, I mean just, uhh, not credibly\nI'm feeling incredibly, I mean let it be\nI just let it be, I mean you, her and me (You make me smile with my heart, oh)\nI mean you, her and me\nMaybe, baby, baby\nBaby, baby\nYou know I was just kidding\nUnless you gon' do it (You make me smile)","title":"addiction"},{"album":null,"lyrics":null,"title":null,"year":null},{"album":null,"lyrics":null,"title":null,"year":null},{"album":"late_registration","lyrics":"You motherfuckers better do your job and roll up, and watch how we roll up\nAnd I can't control it, I can't hold it, it's so nuts\nI take a sip of that 'gnac, I wanna fuck\nI take a hit of that chronic, it got me stuck\nBut really what's amazin' is how I keep blazin'\nTowel under the door, we smoke until the day's end\nPuff, puff and pass, don't fuck up rotation\nHpnotiq for Henny? Now nigga that's a chaser\nTurn nothin' to somethin', now pimpin' that's a savior\nBest things are green now pimpin get your paper\nHigh off the ground from stair to skyscraper\nCool out, thinkin' we local, c'mon homey we major\n\n\nWe major? C'mon homie we major\nWe major? C'mon homie we major\nWe major, c'mon homie we major\nWe major, c'mon\n\nFeelin' better than some head on a Sunday afternoon\nBetter than a chick that say yes too soon\nUntil you have a daughter that's what I call karma\nAnd you pray to God she don't grow breasts too soon\nProjects to' up, gang signs is thrown up\nNiggas hats broke off, that's how we grow up\nWhy else you think shorties write rhymes just to blow up?\nGet they first car and then IRS show up\nHe ain't never had shit, but he had that nine\nNigga come through flickin' and he had that shine\nPut two and two together and a little bad weather\nGon' be your whole family on that funeral line\nAsked the reverend was the strip clubs cool\nIf my tips helped send a pretty girl through school\nThat's all I want, like winos want they good whiskey\nI ain't in the Klan but I brought my hood with me\n\n\nYou motherfuckers better do your job and roll up, and watch how we roll up\nAnd I can't control it, I can't hold it, it's so nuts\nI take a sip of that 'gnac, I wanna fuck\nI take a hit of that chronic, it got me stuck\nBut really what's amazin' is how I keep blazin'\nTowel under the door, we smoke until the day's end\nPuff, puff and pass, don't fuck up rotation\nHpnotiq for Henny? Now nigga that's a chaser\nTurn nothin' to somethin', now pimpin' that's a savior\nBest things are green now pimpin get your paper\nHigh off the ground from stair to skyscraper\nCool out, thinkin' we local, c'mon homey we major\n\n\nWe major? C'mon homie we major\nWe major? C'mon homie we major\nWe major, c'mon homie we major\nWe major, c'mon homie we major\n\nI heard the beat and I ain't know what to write\nFirst line should it be about the hoes or the ice?\nFo-fo's or Black Christ? Both flows'd be nice\nRap about big paper or the black man plight\nAt the studio console, asked my man to the right\nWhat this verse sound like, should I freestyle or write?\nHe said, \"Nas what the fans want is Illmatic, Stillmatic\"\nLooked at the pad and pen, fell, and jotted what I feel\nBeen like twelve years since a nigga first signed\nNow I'm a free agent and I'm thinkin' it's time\nTo build my very own Motown\n'Cause rappers be deprived, of executive nine to five's\nAnd it hurts to see these companies be stealin' the life\nAnd I love to give my blood sweat and tears to the mic\nSo y'all copped the LP's and y'all fiends got dealt\nI'm Jesse Jackson on the balcony when King got killed\nI survived the livest niggas around\nLast longer than more than half of you clowns\nLook, I used to cook before I had the game took\nEither way, my change came like Sam Cooke\nYeah, yeah, yeah yeah\n\n\nFeeling better than I ever felt before today\nLike better late than never is orientation\nStill we can make it better throwing all your cares away\n\n\nYou motherfuckers better do your job and roll up, and watch how we roll up\nAnd I can't control it, I can't hold it, it's so nuts\nI take a sip of that 'gnac, I wanna fuck\nI take a hit of that chronic, it got me stuck\nBut really what's amazin' is how I keep blazin'\nTowel under the door, we smoke until the day's end\nPuff, puff and pass, don't fuck up rotation\nHpnotiq for Henny? Now nigga that's a chaser\nTurn nothin' to somethin', now pimpin' that's a savior\nBest things are green now pimpin' get your paper\nHigh off the ground from stair to skyscraper\nCool out, thinkin' we local, c'mon homey we major\n\n\nWe major? (C'mon homie we major)\nWe major? (C'mon homie we major)\nWe major, (C'mon homie we major)\nWe major\n\n\nFeeling better than I ever felt before today\nLike better late than never is orientation\nStill we can make it better throwing all your cares away\n\n\nCan I talk my shit again?\nCan I talk my shit again?\nI can't believe I'm back up in this motherfucker\nI'mma be late though\nI gotta figure out what I'm finna wear\nYeah, the Roc is definitely in the building\nGOOD Music's definitely in the building\nI gotta say what's up to Tony Williams\nOn the vocals sings, he sings quite beautifully\nDon't you agree? Don't you agree?\nUh, and Jon Brion on the keys right now\nAnd Warren Campbell on the keys right now\nSo they ask me, why you call it \"Late Registration\" Ye?\n'Cause we takin' these motherfuckers back to school\nIf you know this part right here, feel free to sing along\n\n\nFeeling better than I ever felt before today (If you feelin' good)\nBut better late than never it's orientation (It's orientation)\nStill we can make it better, throwin' all your cares away (We want you to get used to this)\n\n\nUh, they can't do what we do baby\nUh-uh, uh-uh, they can't do what we do baby\nUh-uh, uh-uh, they can't do what we do baby\nYeah","title":"we_major"},{"album":null,"lyrics":null,"title":null,"year":null},{"album":"late_registration","lyrics":"Hey Mama, I wanna scream so loud for you, cause I'm so proud of you\nAnd Let me tell you what I'm about to do, Hey Mama\nI know I act a fool but I promise you I'm goin' back to school\nAnd I appreciate what you allowed for me\nAnd I just want you to be proud of me.\nHey Mama.\n\nI wanna tell the whole world about a friend of mine\nThis little light of mine and I'm finna let it shine\nI'm finna take ya'll back to them better times\nI'm gonna talk about my mama if ya'll don't mind\nI was 3 years old, when you and I moved to the Chi\nLate December, harsh winter gave me a cold\nYou fixed me up somethin' that was good for my soul\nFamous homemade chicken soup, can I have another bowl?\nYou work late nights just to keep on the lights\nMommy got me training wheels so I could keep on my bike\nAnd you would give anything in this world\nMichael Jackson leather and a glove, but didn't give me a curl\nAnd you never put no man over me\nAnd I love you for that Mommy can't you see?\n7 years old, I caught you with tears in your eyes\nCause a nigga cheatin' tellin' you lies then I started to cry\nAs we knelt on the kitchen floor\nI said Mommy I'm a love you so you don't hurt no more\nAnd when I'm older, you ain't gotta work no more\nAnd I'm a get you that mansion that we couldn't afford\nSee your unbreakable unmistakable\nHighly capable, lady that's makin loot\nA livin' legend too, just look at what heaven do\nSend us an angel, and I thank you.\n\nHey Mama, I wanna scream so loud for you, cause I'm so proud of you\nAnd Let me tell you what I'm about to do, Hey Mama\nI know I act a fool but I promise you I'm goin' back to school\nAnd I appreciate what you allowed for me\nAnd I just want you to be proud of me.\nHey Mama.\n\nForrest Gump mama said, life is like a box of chocolates\nMy mama told me \"Go to school get your doctorate.\"\nSomethin' to fall back on, you could profit with\nBut still supported me when I did the opposite\nNow I feel like it's things I gotta get\nThings I gotta do, just to prove to you\nYou was gettin' through, can the choir please\nGive me a verse of \"You Are So Beautiful To Me?\"\nCan't you see, you're like a book of poetry\nMaya Angelou, Nicky Jovanni, turn 1 page and there's my Mommy\nCome on Mommy just dance with me, let the whole world see your dancing feet\nNow when I say \"Hey\" ya'll say \"Mama\" now everybody answer me.\n\nHey Mama, I wanna scream so loud for you, cause I'm so proud of you\nAnd Let me tell you what I'm about to do, Hey Mama\nI know I act a fool but I promise you I'm goin' back to school\nAnd I appreciate what you allowed for me\nAnd I just want you to be proud of me.\nHey Mama.\n\nI guess it also depends though, if my ends low\nSecond they get up you gon' get that Benzo\nTint the windows, ride around the city and let your friends know.\nHey Mama.\n\nTell your job you gotta fake 'em out\nSince you brought me in this world, let me take you out\nTo a restaurant, upper echelon\nI'm a get you a jag, whatever else you want\nJust tell me what kind of S-Type Donda West like?\nTell me the perfect color so I make it just right\nIt don't gotta be Mother's Day, or your birthday\nFor me to just call and say \"Hey Mama.\"\n\nI wanna scream so loud for you, cause I'm so proud of you\nAnd Let me tell you what I'm about to do, Hey Mama.\nYou know I love you so and I never let you go\nI wrote this song just so you know no matter where you go my love is true.\nHey Mama.\nHey Mama.\nHey Mama.\nHey Mama.\nHey Mama.\n\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.\nMy mama mama mama.","title":"hey_mama"},{"album":"late_registration","lyrics":"Yeah, you know what this is\nIt's a celebration, bitches!\nGrab a drink, grab a glass\nAfter that I grab your ass.\n\nWhy you actin' all\nShy and all\nWhy is y'all\nLyin' for?\n\"I never did this before...\"\nStop that\nWhat you want some petron?\nI got that.\nI mean I promise y'all\nYou fine and all\nAnd your girlfriend, she kinda raw\nBut she not like you\nNo, she not like you\nRight now I need you to mute all the monologue\nAll that talkin' is gon' give me a tylenol\nYou put a nigga to sleep, I'm tired of ya'll\nRight now the Louis Vuitton Don is signing off\nBut I just thought we should know\nWe hit the liquor store\nGot some Cris and some Mo\nAnd we about to let it flow\nHad some problems before but see we let 'em go\nGot an ounce of that dro\nAnd we about to let it blow.\n\nYeah, you know what this is\nIt's a celebration, bitches!\nGrab a drink, grab a glass\nAfter that, I grab your ass.\n\nSee you know my style\nI'm very wild\nAnd I vow that my child will be well endowed\nLike his daddy\nAnd tell him that you had a phatty\nHe looked up at me said \"Daddy that's the reason why you had me?\"\nYep, we was praticing\n'Til one day your ass bust through the packaging\nYou know what though? You my favorite accident\nSo go head pop some Cristal\nFor my newborn child cause now y'all...\n\nKnow what this is\nIt's a celebration, bitches!\nGrab a drink, grab a glass\nAfter that I grab your ass.\nBut I just thought we should know\nWe hit the liquor store\nGot some Cris and some Mo\nAnd we about to let it flow\nHad some problems before but see we let 'em go\nGot an ounce of that dro\nAnd we about to let it blow.\n\nHoe! Hoe! \nWe lookin' for some\nHoe! Hoe! Hoe!","title":"celebration"},{"album":null,"lyrics":null,"title":null,"year":null},{"album":"late_registration","lyrics":"Wished I had told\nOoh was the only one (Uh oh)\nBut it's too late\nIt's too late, he's gone\n\n\nYou sweat her and I ain't talkin 'bout a Coogi\nYou a Big L and I ain't talkin 'bout Cool J\nSee me at the airport, at least twenty Louis\nTreat me like the Prince and this my sweet brother Numpsay\n(Brother Numpsay) Groupies say I'm too choosy\nTake em to the show and talk all through the movies\nSays she want diamonds, I took her to Ruby Tuesdays\nIf we up in Fridays, I still have it my way\n\n\n(Gone) We striving home\n(Gone) (I ride on chrome), it's too late\n\n\nY'all don't want no prob' from me\nWhat you rappers could get is a job from me\nMaybe you could be my intern\nAnd in turn, I'll show you how I cook up summer in the winter\nAaron love the raw dog, when will he learn?\nCaught something on the Usher tour, he had to let it burn\nPlus he already got three children\nArguin' over babysitters like, \"Bitch it's yo' turn\"\n\"Damn Ye it'd be stupid to diss you\nEven your superficial raps is super-official\"\nRoc pastel with Gucci on\nWith TV's in the ride, throw a movie on\nSaid he couldn't rap, now he at the top with Doobie Long\n'Cause I dookied on any song that they threw me on, gone\n\n\nWe striving home, gone\n(I ride on chrome), gone\nWe striving home, gone\n(Killa, I ride on chrome)\n\nKnock knock, who's there? Killa Cam, Killa who?\nKilla Cam, hustler, grinder, guerilla true\nOh my chinchilla blue, blue you ever dealt with a dealer\nWell here's the deal, ma we going to the dealer, woo\nNo concealing, no ceiling I don't need a roof\nAct up, get out, I don't need you poof\nPoof be gone, damn tough luck dag\nDag, niggas still doing puff-puff-pass\nPull the truck up fast and I tell em\nHey back in a touched up Jag shit\nY'all niggas wanna get in Cam's cerebellum\nAn old man just gon' tell em, \"Too late, he's gone\"\nThen I see how y'all gonna react when I'm gone\nMy last girl want me back then I'm on\nFine stay, you got the grind hey\nCame back, read what the sign say, \"Too late, he's gone)\nYes I know you wanna see my demise\nYeah you church boy, acting like a thief in disguise\nAin’t even my size, see the greed in my eyes\nAsk Abby, I hustle, brought weed to the Chi, shit\nAnd that ain't even a lie, please believe me\nGave Weezie a piece of the pie and\nYou can ask George or Regina\nThe whole West Side I explore with the Bimmer now\n\nWe striving home\nI ride on chrome\nListen, homeboy, move on\nThat's your best bet, why's that, Cons?\n\n\nI been pouring out some liquor for the fact that my pal's gone\nAnd trying to help his mama with the fact that her child gone\nAnd since we used to bubble like a tub full of Calgon\nGuess it's only right that I should help her from now on\nBut since they got afoul on, what could've gone wrong?\nNow they asking Cons, \"How long has this gone on?\"\nAnd maybe all this money might have gone to my head\n'Cause they got me thinking money might have gone to the Feds\nSo I had gone to the dread, but he had gone up to bed\nAnd when I came the next morning he was gone with my bread\nAnd with that being said I had gone on my instincts\nAnd gone to the spots where they go to get mixed drinks\nBut looking back now, I should've gone to the crib\nAnd rented  'cause I'd a-gone in by ten\nBut I had gone with my friend, and we had gone to the bar\nAnd heard a nigga talking shit so I had gone to the car\nAnd now the judge is telling me that I had gone too far\nAnd now we gone for twenty years doing time behind bars\nAnd since I gone to a cell for some petty crimes\nI guess I gone to the well one too many times 'cause I'm gone\n\n\nI'm ahead of my time, sometimes years out\nSo the powers that be won't let me get my ideas out\nAnd that make me wanna get my advance out\nAnd move to Oklahoma and just live at my aunt's house\nYeah, I romance the thought of leaving it all behind\nKanye step away from the lime\nLight like when I was on the grind in the 1999\nBefore model chicks was bending over\nOr dealerships asked me, \"Benz or Rover\"\nMan, if I could just get one beat on Hova\nWe could get up off this cheap-ass sofa\nWhat the summer of the Chi got to offer an eighteen-year-old\nSell drugs or get a job, you gotta play your role\nMy dog worked at Taco Bell, hooked us up plural\nFired a week later, the manager count the churros\nSometimes I can't believe it when I look up in the mirro'\nHow we out in Europe, spending Euros\nThey claim you never know what you got till it's gone\nI know I got it, I don't know what y'all on\nI'mma open up a store for aspiring emcees\nWon't sell 'em no dream, but the inspiration is free\nBut if they ever flip sides like Anakin\nYou'll sell everything including the mannequin\nThey got a new bitch, now you Jennifer Aniston\nHold on, I'll handle it, don't start panickin', stay calm\nShorties at the door 'cause they need more\nInspiration for they life, they souls, and they songs\nThey said, \"Sorry, Mr. West is gone\"","title":"gone"},{"album":"late_registration","lyrics":"Diamonds are forever\nThey won't leave in the night\nI've no fear that they might\nDesert me\n\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme.\nForever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever?......\n\nClose your eyes and imagine, feel the magic\nVegas on acid,\nSeen through Yves St. Laurent glasses\nAnd I've realized that I've arrived, cuz\nIt take more than a magazine to kill my Vibrate does\nhe write his own rhymes, so sort of\nI think 'em\nThat mean I forgot better shit than you ever thought up\nDamn, is he really that caught up?\nI ask if you talkin' bout classics, do my name get brought up?\nI remember I couldn't afford a Ford Escort or even a four-track recorder\nso its only right that I let the top drop on a drop-top Porsche\n- its for yourself that's important\nIf you're a stripper named Porscha and you get tips from many men\nThen your fat friend her nickname is Minivan\nExcuse me,\nThat's just the Henny, man, I smoke, I drink, I'm supposed to stop I can't because\n\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme.\nForever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever?......\n\nI was sick about awards\nCouldn't nobody cure me\nOnly playa that got robbed but kept all his jewelry\nAlicia Keys tried to talk some sense to them\n30 minutes later seems there's no convincing them\nWhat more could you ask for?\nThe international asshole\nWho complains about what he is owed?\nAnd throw a tantrum like he is three years old\nYou gotta love it though somebody still speaks from his soul\nAnd wouldn't change by the change, or the game, or the fame, \nWhen he came, in the game, he made his own lane\nNow all I need is y'all to pronounce my name\nIts Kanye - But some of my plaques - they still say Kane\nGot family in the D, Kin-folk from Motown\nBack in the Chi - them folks ain't from Motown\nLife movin' too fast I need to slow down\nGirl ain't give me no ass, ya need to go down\n\nDiamonds are forever (forever, forever)\nMy father Ben said I need Jesus\nSo he took me to church and let the water wash over my ceaser\nDiamonds are forever (forever, forever)\nThe preacher said we need leaders\nRight then my body got still like a paraplegic\n\nYou know who you can call you gotta best believe it\nThe Roc stand tall and you would never believe it\nTake your diamonds and throw 'em up like you bulimic\nYea the beat cold but the flow is anemic\nAfter debris settles and the dust get swept off\nBig K pick up where young Hov left off\nRight when magazines wrote Kanye West off\nI dropped my new shit, it sound like the best of\nA&R's lookin' like \"Pssh we messed up\"\nGrammy night, damn right, we got dressed up\nBottle after bottle 'till we got messed up\nIn the studio, where really though, yea he next up\nPeople askin' me if I'm gon' give my chain back\nThat'll be the same day I give the game back\nYou know the next question dog \"Yo, where Dame at?\"\nThis track the Indian dance to bring our reign back\n\"What's up with you and Jay, man, are y'all ok man?\"\nThey pray for the death of our dynasty like Amen\nR-r-r-right here stands a-man\nWith the power to make a diamond with his bare hands...\n\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme.\nForever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever?......\n\nDiamonds are forever (forever, forever)\nDiamonds are forever (forever, forever, forever)","title":"diamonds_from_sierra_leone"},{"album":"late_registration","lyrics":"Little girl, please stop your crying\n'Cause I'll be late for that\n\n\nI'll be late for that, baby I'll wait for that\nIf you had a taste of that, you'd probably pay for that\nI'm comin' in when I feel like\nSo turn this motherfucker up only if it feels right\n\nI'll be late for that, I can't wait for that\nI think I was made for that\nSo I'm comin' in when I feel like\nSo turn this motherfucker up only if it feels right\n\n\nLittle girl, please stop your crying\n'Cause I'll be late for that\n\n\nStop all your blood clot cryin', I was flyin'\nMade it to school with barely enough time to sign in\nYeah, I hear the alarm, yeah, I hear ya mom\nYeah yeah, I don't want be broke when I'm thirty-one\nThey said the best classes go to the fastest\nSorry Mr. West, there's no good classes and that's what yo' ass get\nNot even electives? Not even pre-requits?\nYou mean I missed my major by a couple of seconds?\nNow I'm in the shop class or the basket weavin'\nWith all the rest of the motherfuckers underachievin'\nMan, this is a insult\nI went to junior high with all of them and they been slow\nIf I can catch the beat then slow down the tempo\nJust throw this at the end if I'm too late for the intro\nWill I make it from the student loans to a Benzo?\nLike old folks pissin', I guess it all depends, oh, oh\n\n\nLittle girl, please stop your crying (Stop your cryin' baby)\n'Cause I'll be late for that\n\n\nI'll be late for that, baby I'll wait for that\nIf you had a taste of that, you'd probably pay for that\nI'm comin' in when I feel like\nSo turn this motherfucker up only if it feels right\n\nI'll be late for that, I can't wait for that\nI think I was made for that\nSo I'm comin' in when I feel like\nSo turn this motherfucker up only if it feels right\n\n\nLittle girl, please stop your crying\n'Cause I'll be late for that\n\n\nYou know when you be late, you miss all the lights\nThat's right, that's right, that's right, that's right\nAnd when you get back she gon' start up a fight\nThat night, that night, that night\nBaby it's too late for that, lately I've been takin' it slow\nTry and make it to the party 'fore the guest list close\nWith the freshest hoes, the professors know\nWe about to get real unprofessional\nLike them eskimos, what would you do for a Klondike?\nOr two dykes that look Christina Milian-like\nHm, I'll be on time for that\nI ain't thought of no line that could rhyme with that\nYo, I'll be there in five minutes\nFive hours later, I'll be there in five minutes, go 'head ride with it\nI'm so live with it, look how I did it\nBeen bullshittin' but I finally arrived with it\nI know it's late and I took all year but\nYou can stop complainin' 'cause I'm finally here, yeah\n\n\n'Cause I'll be late for that\nI'll be late for that\nI'll be late for that\nI'll be late for that","title":"late"}]