[{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"You might think you've peeped the scene\nYou haven't, the real one's far too mean\nThe watered down one, the one you know\nWas made up centuries ago\nIt made it sound all whack and corny\nYes, it's awful, blasted boring\nTwisted fiction, sick addiction\nWell gather 'round children, zip it, listen\n\n\n(Can we get much higher?)\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\nOh (Can we get much higher?)\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\n\nOh can we get much higher?\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\nOh can we get much higher?\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\n\n\nYeah\nYeah\nYeah\nYeah\n\nI fantasized 'bout this back in Chicago\nMercy, mercy me, that Murcielago\nThat's me, the first year that I blow\nHow you say broke in Spanish? Me no hablo\nMe drown sorrow in that Diablo\nMe found bravery in my bravado\nDJs need to listen to the models\nYou ain't got no fuckin' Yeezy in your Serrato?\n(You ain't got no Yeezy, nigga?)\nStupid, but what the fuck do I know?\nI'm just a Chi-town nigga with a Nas flow\nAnd my bitch in that new Phoebe Philo\nSo much head, I woke up in Sleepy Hollow\n\n\nCan we get much higher? \n(Oh, oh, oh, oh, oh, oh, oh, oh, oh)\n\n\nLook like a fat booty Celine Dion\nSex is on fire, I'm the King of Leon-a Lewis, beyond the truest\nHey, teacher, teacher, tell me how do you respond to students\nAnd refresh the page and restart the memory\nRespark the soul and rebuild the energy?\nWe stopped the ignorance, we killed the enemy\nSorry for the night demons still visit me\nThe plan was to drink until the pain over\nBut what's worse, the pain or the hangover?\nFresh air, rolling down the window\nToo many Urkels on your team, that's why your wins low\nDon't make me pull the toys out, huh\nDon't make me pull the toys\nAnd fire up the engines, huh\nAnd then they make noise, oh\n\n\nCan we get much higher?\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\n\n\nAt the mall, there was a seance\nJust kids, no parents\nThen the sky filled with herons\n(I saw the devil) In a Chrysler LeBaron\nAnd the hell, it wouldn't spare us\nAnd the fires did declare us\nBut after that, took pills, kissed an heiress\nAnd woke up back in Paris\n\n\n(Can we get much higher?)\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\n\n(Can we get much higher?)\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\n(Can we get much higher?)\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\n\nCan we get much higher?\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\nCan we get much higher?\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh\nCan we get much higher?\nSo high, oh, oh, oh, oh, oh, oh, oh, oh, oh","title":"dark_fantasy"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"Ain't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\nNot for nothing I've forseen it, I dream it\nI can feel it slowly dripping away from me\nNo more chances if you blow this, you bogus\nI will never ever let you live this down, down, down\n\n\nPenitentiary chances, the devil dances\nAnd eventually answers to the call of autumn\nAll of them fallin' for the love of ballin'\nGot caught with thirty rocks, the cop look like Alec Baldwin\nInter-century anthems based off inner city tantrums\nBased off the way we was branded\nFace it, Jerome get more time than Brandon\nAnd at the airport they check all through my bag and tell me that it's random\nBut we stay winning, this week has been a bad massage\nI need a happy ending and a new beginning\nAnd a new fitted and some job opportunities thats lucrative\nThis the real world, homie, school finished\nThey done stole your dreams, you dunno who did it\nI treat the cash the way the government treats AIDS\nI won't be satisfied till all my niggas get it, get it?\n\n\nAin't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\n\n\nIs hip hop just a euphemism for a new religion?\nThe soul music for the slaves that the youth is missing\nBut this is more than just my road to redemption\nMalcolm West had the whole nation standing at attention\nAs long as I'm in Polo's smilin' they think they got me\nBut they would try to crack me if they ever see a black me\nI thought I chose a field where they couldn't sack me\nIf a nigga ain't running shootin a jump shot running a track meet\nBut this pimp is, at the top of Mount Olympus\nReady for the World's game, this is my Olympics\nWe make 'em say ho 'cause the game is so pimpish\nChoke a South Park writer with a fishstick\nI insisted to get up off a this dick\nAnd these drugs, niggas can't resist it\nRemind me of when they tried to have Ali enlisted\nIf I ever wasn't the greatest, nigga, I must have missed it\n\n\nAin't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\n\n\nI need more drinks and less lights\nAnd that American Apparel girl in just tights\nShe told the director she tryna get in a school\nHe said, \"Take them glasses off and get in the pool\"\nIt's been a while since I watched the tube\n'Cause like a Crip said, \"I got way too many blues for any more bad news\"\nI was looking at my resume feeling real fresh today\nThey rewrite history I don't believe in yesterday\nAnd what's a black Beatle anyway? A fucking roach\nI guess that's why they got me sitting in fucking coach\nBut God said I need a different approach\n'Cause people is looking at me like I'm sniffing coke\nIt's not funny anymore, try different jokes\nTell 'em hug and kiss my ass, X and O\nKiss the ring while they at it, do my thing while I got it\nPlay strings for the dramatic and end all of that wack shit\nAct like I aint had a belt in two classes\nI ain't got it I'm going after whoever who has it\nI'm coming after whoever who has it?\nYou blowing up, that's good, fantastic\nThat y'all, it's like that ya'll\nI don't really give a fuck about it at all\n'Cause the same people that tried to black ball me forgot about two things, my black balls\n\n\nAin't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\n\n\nAyo, I done copped Timb's, lived in lenses, kid\nArmani suits, fresh fruits, Bally boots, and Benzes\nCounting up, smoking, one cuff\nLive as a red Jag, a Louis bag, grabbing a blunt, fuck it\nSteam about a hundred and one L's\nKites off to jails, buying sweats, running up in Stetson\nNigga hat game was special\nIt matched every black pair of Nikes, throwing dice for decimals\nThe older head, bolder head, would train a soldier head\nMake sure he right in the field, not a soldier dead\nThat meant code red, bent off the black skunk\nThe black Dutch, back of the old shed\nIf you can't live, you dying, you give or buy in\nKeep it real or keep it moving, keep grinding\nKeep shining, to every young man, this is a plan\nLearn from others like your brothers Rae and Kanye\n\n\nNot for nothing I've forseen it, I dream it\nI can feel it slowly drifting away from me\nNo more chances if you blow this, you bogus\nI will never ever let you live this down, down, down","title":"gorgeous"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"I'm livin' in that 21st century, doin' something mean to it\nDo it better than anybody you ever seen do it\nScreams from the haters, got a nice ring to it\nI guess every superhero need his theme music\n\n\nNo one man should have all that power\nThe clock's tickin', I just count the hours\nStop trippin', I'm trippin' off the power\n(21st century schizoid man)\n\n\nThe system broken, the schools closed, the prisons open\nWe ain't got nothin' to lose, motherfucker, we rollin'\nHuh? Motherfucker, we rollin'\nWith some light-skinned girls and some Kelly Rowlands\nIn this white man world, we the ones chosen\nSo good night, cruel world, I see you in the mornin'\nHuh? I see you in the mornin'\nThis is way too much, I need a moment\n\nNo one man should have all that power\nThe clock's tickin', I just count the hours\nStop trippin', I'm trippin' off the power\nTill then, fuck that, the world's ours\n\n\nAnd then they (Go)\nAnd then they\nAnd then they (Go)\nAnd then they\n\nAnd then they (Go)\nAnd then they\n(21st century schizoid man)\n\n\nOoh, fuck SNL and the whole cast\nTell 'em Yeezy said they can kiss my whole ass\nMore specifically, they can kiss my asshole\nI'm an asshole? You niggas got jokes\nYou short-minded niggas' thoughts is Napoleon\nMy furs is Mongolian, my ice brought the goalies in\nNow I embody every characteristic of the egotistic\nHe knows he so fuckin' gifted\nI just needed time alone with my own thoughts\nGot treasures in my mind, but couldn't open up my own vault\nMy childlike creativity, purity, and honesty\nIs honestly being crowded by these grown thoughts\nReality is catchin' up with me\nTakin' my inner child, I'm fighting for it, custody\nWith these responsibilities that they entrusted me\nAs I look down at my diamond-encrusted piece\n\nThinkin' no one man should have all that power\nThe clock's tickin', I just count the hours\nStop trippin', I'm trippin' off the powder\nTill then, fuck that, the world's ours\n\n\nAnd then they (Go)\nAnd then they\nAnd then they (Go)\nAnd then they\n\nAnd then they (Go)\nAnd then they\n(21st century schizoid man)\n\n\nColin Powers, Austin Powers\nLost in translation with a whole fuckin' nation\nThey say I was the abomination of Obama's nation\nWell, that's a pretty bad way to start the conversation\nAt the end of day, goddammit, I'm killin' this shit\nI know damn well y'all feelin' this shit\nI don't need yo' pussy, bitch, I'm on my own dick\nI ain't gotta power trip, who you goin' home with?\nHow Ye doin'? I'm survivin'\nI was drinkin' earlier, now I'm drivin'\nWhere the bad bitches, huh? Where ya hidin'?\nI got the power, make yo' life so excitin'\n\nNow this'll be a beautiful death\n(I'm jumpin' out the window\nLettin' everything go\nLettin' everything go)\n\nNow this'll be a beautiful death\n(Jumpin' out the window\nLettin' everything go\nLettin' everything go)\n\nNow this'll be a beautiful death\n(Jumpin' out the window\nLettin' everything go\nLettin' everything go)\nYou got the power to let power go?\n\n\n21st century schizoid man","title":"power"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"All of the lights, all of the lights\nLights, lights\nAll of the lights\n\n\nTurn up the lights in here, baby\nExtra bright, I want y'all to see this\nTurn up the lights in here, baby\nYou know what I need\nWant you to see everything\nWant you to see all of the lights\n\n\nFast cars, shooting stars\n(All of the lights, all of the lights)\nUntil it's Vegas everywhere we are\n(All of the lights, all of the lights)\n\n\nIf you want it, you can get it for the rest of your life\nIf you want it, you can get it for the rest of your life\n\n\nSomething wrong, I hold my head\nMJ gone, our nigga dead\nI slapped my girl, she called the feds\nI did that time and spent that bread\nI'm heading home, I'm almost there\nI'm on my way, heading up the stairs\nTo my surprise, a nigga replacing me\nI had to take him to that ghetto university (All of the lights)\n\nCop lights, flash lights\nSpot lights, strobe lights\nStreet lights\n(All of the lights, all of the lights)\nFast life, drug life\nThug life, rock life\nEvery night\n(All of the lights, all of the lights)\n\n\nTurn up the lights in here, baby\nExtra bright, I want y'all to see this\nTurn up the lights in here, baby\nYou know what I need\nWant you to see everything\nWant you to see all of the lights\n\n\nRestraining order, can’t see my daughter\nHer mother, brother, grandmother hate me in that order\nPublic visitation, we met at Borders\nTold her she take me back, I'll be more supportive\nI made mistakes, I bumped my head\nCourts sucked me dry, I spent that bread\nShe need her daddy, baby please\nCan't let her grow up in that ghetto university (All of the lights)\n\nCop lights, flash lights\nSpot lights, strobe lights\nStreet lights\n(All of the lights, all of the lights)\nFast life, drug life\nThug life, rock life\nEvery night\n(All of the lights, all of the lights)\n\n\nTurn up the lights in here, baby\nExtra bright, I want y'all to see this\nTurn up the lights in here, baby\nYou know what I need\nWant you to see everything\nWant you to see all of the lights\n\n\nGetting mine, baby\nGot to let these niggas know, yeah\nGetting right, babe\nYou should go and get your own\nGetting mine, baby\nGot to let these niggas know, yeah\nGetting right, babe\nYou should go and get your own\n\n\nUnemployment line, credit card declined\nDid I not mention I was about to lose my mind\nAnd also was about to do that line?\nOkay, okay, you know we going all the way this time\n\nWe going all the way this time\nWe going all the way this time\nWe going all the way this time\nWe going all the way this time\nWe going all the way this time\n\n\nTurn up the lights in here, baby\nExtra bright, I want y'all to see this\nTurn up the lights in here, baby\nYou know what I need\nWant you to see everything\nWant you to see all of the lights\n\n\n(Whoa, whoa)\nI tried to tell you but all I could say was\n\"Whoa, whoa\"\nI tried to tell you but all I could say was\n\"Whoa, whoa\"\nI tried to tell you but all I could say was\n\"Whoa, whoa\"\nI tried to tell you but all I could say","title":"all_of_the_lights"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"I shoot the lights out\nHide till it's bright out\nWhoa, just another lonely night\nAre you willing to sacrifice your life?\n\n\nBitch, I'm a monster, no good blood sucker\nFat motherfucker, now look who's in trouble\nAs you run through my jungles all you hear is rumbles\nKanye West samples, here's one for example\n\n\nGossip gossip, nigga just stop it\nEverybody know I'm a motherfucking monster\nI'mma need to see your fucking hands at the concert\nI'mma need to see your fucking hands at the concert\n\nProfit profit, nigga I got it\nEverybody know I'm a motherfucking monster\nI'mma need to see your fucking hands at the concert\nI'mma need to see your fucking hand\n\nOh, the best living or dead hands down, huh?\nLess talk more head right now, huh?\nAnd my eyes more red than the devil is\nAnd I'm bout to take it to another level bitch\nMatter who you go and get, ain't nobody cold as this\nDo the rap and the track, triple double no assist\nAnd my only focus is staying on some bogus shit\nArgue with my older bitch acting like I owe her shit\nI heard that people sing raps to give the track pain\nBought the chain that always give me back pain\nFuckin up my money so, yeh, I had to act sane\nChi nigga but these hoes love my accent\nChick came up to me and said, \"This the number to dial\nIf you wanna make your number one your number two now\nThis that goose and malibu, I call it Malibooyah\"\nGoddamn, Yeezy, how he hit em with the new style\nThrow that motherfucker, \"Well, whatchu gon' do now?\nWhatever ever I wanna do, gosh it's cool now\"\nKnow I'm gonna do, ah, it's the new now\nThink you motherfuckers really really need to cool out\n'Cause you will never get on top of this\nSo mommy best advice is just to get on top of this\nHave you ever had sex with a pharaoh?\nI put the pussy in a sarcophagus\nNow she claiming that I bruise her esophagus\nHead of the class and she just want a swallowship\nI'm living the future so the present is my past\nMy presence is a present, kiss my ass\n\n\nGossip gossip, nigga just stop it\nEverybody know I'm a motherfucking monster\nI'mma need to see your fucking hands at the concert\nI'mma need to see your fucking hands at the concert\n\nProfit profit, nigga I got it\nEverybody know I'm a motherfucking monster\nI'mma need to see your fucking hands at the concert\nI'mma need to see your fucking hand\n\n\nSasquatch, Godzilla, King Kong, Lochness\nGoblin, Ghoul, a zombie with no conscience\nQuestion, what do these things all have in common?\nEverybody knows I'm a motherfucking monster\nConquer, stomp ya, stop your silly nonsense\nNonsense, none of you niggas know where the swamp is\nNone of you niggas have seen the carnage that I've seen\nI still hear fiends scream in my dreams\nMurder murder in black convertibles, I\nKill the block I murder the avenues, I\nRape and pillage a village, women and children\nEverybody wanna know what my Achilles heel is?\nLove, I don't get enough of it\nAll I get is these vampires and blood suckers\nAll I see is these niggas I've made millionnaires\nMilling about, spilling there feelings in the air\nAll I see is these fake fucks with no fangs\nTryna draw blood from my ice cold veins\nI smell a massacre\nSeems to be the only way to back you bastards up\n\n\nGossip gossip, nigga just stop it\nEverybody know I'm a motherfucking monster\nI'mma need to see your fucking hands at the concert\nI'mma need to see your fucking hands at the concert\n\nProfit profit, nigga I got it\nEverybody know I'm a motherfucking monster\nI'mma need to see your fucking hands at the concert\nI'mma need to see your fucking hand\n\n\nPull up in a monster automobile, gangsta\nWith a bad bitch that came from Sri Lanka\nYeah I'm in that Tonka color of Willy Wonka\nYou could be the king but watch the queen conquer\nFirst things first I'll eat your brains\nThen I'mma start rocking gold teeth and fangs\n'Cause that's what a muthafucking monster do\nHairdresser from Milan, that's the monster 'do\nMonster Giuseppe heel, that's the monster shoe\nYoung Money is the roster and a monster crew\nAnd I'm all up all up all up in the bank with the funny face\nAnd if I'm fake, I ain't notice 'cause my money ain't\nSo let me get this straight, wait, I'm the rookie?\nBut my features and my shows ten times your pay?\n50k for a verse, no album out\nYeah my money's so tall that my Barbie's gotta climb it\nHotter than a middle eastern climate, find it\nTony Matterhorn dutty wine it, wine it\nNicki on them titties, when I sign it\nThat's how these niggas so one-track minded\nBut really, really I don't give a F-U-C-K\nForget Barbie, fuck Nicki, 'cause she's fake\nShe's on a diet but my pockets eating cheesecake\nAnd I'll say bride of Chucky is child's play\nJust killed another career, it's a mild day\nBesides 'Ye, they can't stand besides me\nI think me, you and Am should ménage Friday\nPink wig, thick ass, give 'em whiplash\nI think big, get cash, make 'em blink fast\nNow look at what you just saw, this is what you live for\nAaaaahhh, I'm a motherfucking monster\n\n\nI, I crossed the line, line\nAnd I'll, I'll let God decide, cide\nI, I wouldn't last these shows\nSo I, I am headed home\n\nI, I crossed the line, line\nAnd I'll, I'll let God decide, cide\nI, I wouldn't last these shows\nSo I, I am headed home\n\nI, I crossed the line, line\nAnd I'll, I'll let God decide, cide\nI, I wouldn't last these shows\nSo I, I am headed home","title":"monster"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"One hand in the air if you don't really care\nTwo hands in the air if you don't really care\nIt's like that sometimes I mean ridiculous\nIt's like that sometimes this shit ridiculous\nOne hand in the air if you don't really care\nMiddle finger in the air if you don't really care\nIt's like that sometimes, man ridiculous\nLife can be sometimes ridiculous\n\n\nI'm so appalled, Spalding ball\nBalding, Donald Trump taking dollars from y'all\nBaby you're fired, your girlfriend hired\nAnd if you don't mind I'mma keep you on call\nWe above the law, we don't give a fuck 'bout y'all\nI got dogs that'll chew a fuckin' hole through the wall\nBut since they all lovers, I need more rubbers\nAnd if I don't use rubbers, need more covers\nHousekeeping, I mean got damn one time\nLet it be a bad bitch sweeping\nThat know we get O's like Cheerios\nThat know because they seen us in the videos\nThat know, the day that you play me\nWill be the same day MTV played videos\nThat was a little joke, voila\nPraises due to the most high, Allah\nPraises due to the most fly, Prada\nBaby I'm magic, ta da\nAddress me as your highness\nHigh as United, thirty thousand feet up and you are not invited\nNiggas be writin' bullshit like they gotta work\nNiggas is going through real shit, man they outta work\nThat's why another got damn dance track, gotta hurt\nThat's why I rather spit something that gotta perk\n\n\nChampagne wishes, thirty white bitches\nI mean this shit is fucking ridiculous\nFucking ridiculous\nI mean this shit is fucking ridiculous\n(Five star dishes, different exotic fishes\nMan this shit is fucking ridiculous\nFucking ridiculous)\n\n\nHow should I begin this, I'm just so offended\nHow am I even mentioned by all these fucking beginners?\nI'm so appalled I might buy the mall\nJust to show niggas how much more I have in store\nI'm fresher than you all, so I don't have to pause\nAll of y'all can suck my balls through my drawers\nDark Knight feeling, die and be a hero\nOr live long enough to see yourself become a villain\nI went from the favorite to the most hated\nOr would you rather be underpaid or overrated?\nMoral victories is for minor league coaches\nAnd Ye already told you we major, you cockroaches\nShow me where the boats is, Ferrari Testarossa's\nThe Hammer went broke so you know I'm more focused\nI lost thirty mill so I spent another thirty\n'Cause unlike Hammer thirty million can't hurt me\nFucking insane, the fuck am I sayin'?\nNot only am I fly, I'm fucking not playing\nAll these little bitches too big for their britches\nBurning their little bridges, fucking ridiculous\n\n\nChampagne wishes, thirty white bitches\nI mean this shit is fucking ridiculous\nFucking ridiculous\nI mean this shit is fucking ridiculous\n(Five star dishes, different exotic fishes\nMan this shit is fucking ridiculous\nFucking ridiculous)\n\n\nSuccess is what you make it, take it how it come\nA half a mil in twenties like a billion where I'm from\nAn arrogant drug dealer the legend I've become\nCNN said I'd be dead by twenty-one\nBlackjack I just pulled in aces\nYou looking at the king in his face\nEverything I dream, motherfuckers, I'm watching it take shape\nWhile to you I'm just a young rich nigga that lacks faith\nRange Rove leather roof, love war fuck a truce\nStill move a bird like I'm in bed with mother goose\nThem hoes coming in a bakers dozen\nClaiming they was with me when they know they really wasn't\nI keep the city's best, never said she was the brightest\nSo if you had her too, it don't affect me in the slightest\nI never met a bitch that didn't need a little guidance\nSo I dismiss her past until she disappoints your highness\nI speak the gospel, hostile\nTony doing time for what he did to nostrils\nParanoid mind I'm still under the watchful\nEye of the law, aspire for more\nThem kilo's came we gave you Bobby Brown jaw\nFlaws ain't flaws when it's you that makes the call\nFlow similar to the legend of the falls\nSpillin' I own you all, yeah\n\n\nOne hand in the air if you don't really care\nTwo hands in the air if you don't really care\nIt's like that sometimes I mean ridiculous\nIt's like that sometimes this shit ridiculous\nOne hand in the air if you don't really care\nMiddle finger in the air if you don't really care\nIt's like that sometimes, man ridiculous\nLife can be sometimes ridiculous\n\n\nI am so outrageous\nI wear my pride on my sleeve like a bracelet\nIf God had a iPod, I'd be on his playlist\nMy phrases amazes the faces in places\nThe favorite, huh, my cup over runneth with hundreds\nDummy, dammit, not like for me to waste it\nThe new commandment, thou shall not hate kid\nMy movement is like the civil rights I'm Ralph David\nAbernathy, so call my lady Rosa Parks\nI am nothing like them niggas baby those are marks\nI met this girl on Valentine's Day, fucked her in May\nShe found out about April so she chose to march\nDamn another broken heart\nI keep bitches by the twos nigga, Noah's Ark\nI got a seven on me, I call my bro Lamar\nPlus a Trojan in my pocket, Matt Leinart\nG-A-T in the Pathfinder\n'Cause you haters got PhDs\nY'all just some major haters and some math minors\nTiger Woods don't make me grab iron\n\n\nAyo, champagne wishes and thirty white bitches\nYou know this shit is fucking ridiculous\nFucking ridiculous\nYou know this shit is fucking ridiculous\nCars for the missus and furs for the mistress\nYou know that shit is fucking ridiculous\nFucking ridiculous\nYou know this shit is fucking ridiculous\n\nFucking ridiculous\nFucking ridiculous\nFucking ridiculous\n\n\nOne hand in the air if you don't really care\nTwo hands in the air if you don't really care\nIt's like that sometimes I mean ridiculous\nIt's like that sometimes this shit ridiculous\nOne hand in the air if you don't really care\nMiddle finger in the air if you don't really care\nIt's like that sometimes, man ridiculous\nLife can be sometimes ridiculous","title":"so_appalled"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"I love it though\nI love it though\n\nUh put your hands to the constellations\nThe way you look should be a sin, you my \"sin-sation\"\nI know I'm preaching to the congregation\nWe love Jesus but you done learned a lot from Satan\nI mean a nigga did a lot of waiting\nWe ain't married but tonight I need some consummation\n\nMay the Lord forgive us, may the gods be with us\nAnd that magic hour I seen good Christians\nMake rash decisions oh she do it,\nWhat happened to religion? oh she lose it\n\nShe putting on her make up, she casually allure\nText message break up, the casualty of tour\nHow she gone wake up and not love me no more\nI thought I was the ass hole, I guess it's rubbing off\n\nHood phenomenon, the LeBron of rhyme\nHard to be humble when you stuntin on a jumbotron\nI'm looking at her like \"this what you really wanted, huh?\"\nWhat we argue anyway, oh I forgot its summertime\n\nUh put your hands to the constellations\nThe way you look should be a sin, you my \"sin-sation\"\nI know I'm preaching to the congregation\nWe love Jesus but you done learned a lot from Satan\nI mean a nigga did a lot of waiting\nWe ain't married but tonight I need some consummation\n\nWhen the sun go down its the magic hour (The magic hour)\nAnd outta all the colours that are still up the skies\nYou got green on your mind, I can see it in your eyes\n\nWhy you standing there with your face screwed up\nDon't leave while your hot that's how Mase screwed up\nThrowing shit around, the whole place screwed up\nMaybe I should call Mase so that he could pray for us\n\nI hit the Jamaican spot, at the bar, take a seat\nI ordered you jerk, she said \"you are what you eat\"\nYou see I always loved your sense of humour\nBut tonight you should have seen how quiet the room was\n\nThe Lyor Cohen or Dior Homme thats\nDior Homme not Dior homie\nThe crib scarface couldn't be more Tony\nYou love me for me could you be more phoney\n\nUh put your hands to the constellations\nThe way you look should be a sin, you my \"sin-sation\"\nHaven't said a word, haven't said a word\nTo me this evening\nCat got your tongue?\n\n\nLookin' at my bitch i bet she give yo ass a bone\nLookin' at my wrist, itta turn yo ass to stone\nStretch limousine, sippin rosé all alone\nDouble headed monster with a mind of its own\n\nCherry red chariot excess is just my character\nAll black tux, nigga shoes lavender\nI never needed acceptance from all you outsiders\nHad cyphers with yeezy before his mouth wired\n\nBefore his jaw shattered climbing up the lord's ladder\nWe still speeding, running signs like they don't matter\nHater talking never made me mad\nNever that not when i'm in my favorite paper tag\n\nTherefore G4s at the Clearport\nWhen it come to tools fool I’m a Pep Boy\nWhen it came to dope I was quick to export\nNever tired of ballin’ so it’s on to the next sport\n\nNew Mercedes sedan, they’ll export\nSo many cars DMV thought it was mail fraud\nDifferent traps, I was gettin’ mail from\nPolk County, Jacksonville, rep Melbourne\n\nWhole clique appetites had tapeworms\nSpinnin’ Teddy Pendergrass vinyl as my jay burns\nI shed a tear before the night's over\nGod bless the man I put this ice over\n\nGettin’ 2Pac money twice over\nStill a real nigga, red Coogi sweater, dice roller\nI’m makin’ love to the angel of death\nCatchin’ feelings never stumble retracin’ my steps","title":"devil_in_a_new_dress"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"Look at ya, look at ya\nLook at ya, look at ya\nLook at ya, look at ya\nLook at ya, look at ya\nLook at ya, look at ya\nLook at ya, look at ya\nLook at ya, look at ya\n\nLook at ya, look at ya\nLook at ya, look at ya\nLook at ya, look at ya\n\n\nLook at ya, look at ya (Ladies and gentlemen)\nLook at ya, look at ya\nLook at ya, look at ya (Ladies and gentlemen)\n\n\nAnd I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\nSo I think it's time, for us, to have a toast\nLet's have a toast for the douchebags, let's have a toast for the assholes\nLet's have a toast for the scumbags, every one of them that I know\nLet's have a toast for the jerkoffs, that'll never take work off\nBaby I got a plan, run away fast as you can\n\nShe find pictures in my email\nI sent this bitch a picture of my dick\nI don't know what it is with females\nBut I'm not too good at that shit\nSee I could have me a good girl\nAnd still be addicted to them hoodrats\nAnd I just blame everything on you\nAt least you know that's what I'm good at\n\nAnd I always find, yeah I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\nSo I think it's time, for us, to have a toast\nLet's have a toast for the douchebags, let's have a toast for the assholes\nLet's have a toast for the scumbags, every one of them that I know\nLet's have a toast for the jerkoffs, that'll never take work off\nBaby I got a plan, run away fast as you can\n\n\nRun away from me baby, run away\nRun away from me baby, run away (Look at ya)\nMan I'm 'bout to get crazy, just run away\nThis is my plan, run away as fast as you can\n\nRun away from me baby, run away\nRun away from me baby, run away (Look at ya)\nMan I'm 'bout to get crazy, why can't she just, run away? (Look at ya)\nBaby I got a plan, run away as fast as you can\n\n\n24/7, 365, pussy stays on my mind\nI, I, I, I did it, all right, alright, I admit it\nNow pick your next move, you could leave or live with it\nIchabod Crane with that motherfucking top off\nSplit and go where? Back to wearing knockoffs, haha\nKnock it off, Neiman's, shop it off\nLet's talk over mai tais, waitress, top it off\nHoes like vultures, wanna fly in your Freddy loafers\nYou can't blame 'em, they ain't never seen Versace sofas\nEvery bag, every blouse, every bracelet\nComes with a price tag, baby, face it\nYou should leave if you can't accept the basics\nPlenty hoes in the balla-nigga matrix\nInvisibly set, the Rolex is faceless\nI'm just young, rich, and tasteless, P\n\n\nNever was much of a romantic\nI could never take the intimacy\nAnd I know I did damage\n'Cause the look in your eyes is killing me\nI guess you are at an advantage\n'Cause you can blame me for everything\nAnd I don't know how I'mma manage\nIf one day you just up and leave\n\nAnd I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\nSo I think it's time, for us, to have a toast\nLet's have a toast for the douchebags, let's have a toast for the assholes\nLet's have a toast for the scumbags, every one of them that I know\nLet's have a toast for the jerkoffs, that'll never take work off\nBaby I got a plan, run away fast as you can\n\nCue the pianos\n\nAnd I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\nSo I think it's time for us to have a toast\n\nAnd I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\n\nAnd I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\nSo I think it's time for us to have a toast\n\nAnd I always find, yeah I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\nSo I think it's time for us to have a toast\n\nAnd I always find, yeah I always find somethin' wrong\nYou been puttin' up with my shit just way too long\nI'm so gifted at findin' what I don't like the most\nSo I think it's time for us to have a toast","title":"runaway"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"I think I just fell in love with a porn star\nTurn the camera on, she a born star\nTurn the corners in a foreign car\nCall the coroners, do the CPR\nShe gave that old nigga a ulcer\nHer bittersweet taste made his gold teeth ache\nMake her knees shake, make a priest faint\nMake a nun cum, make her cremate\nMove downtown, cop a sweet space\nLivin' life like we won the sweepstakes, what\nWe headin to hell for heaven's sake, huh\nWell I'mma levitate, make the devil wait, yeah\n\nHave you lost your mind?\nTell me when you think we crossed the line\nNo more drugs for me, pussy and religion is all I need\nGrab my hand and baby we'll live a hell of a life\n\nNever in your wildest dreams\nNever in your wildest dreams, in your wildest\nYou could hear the loudest screams\nComin' from inside the screen, you a wild bitch\nTell me what I gotta do to be that guy\nSaid her price go down, she ever fuck a black guy\nOr do anal, or do a gangbang\nIt's kinda crazy that's all considered the same thing\nWell I guess a lotta niggas do gang bang\nAnd if we run trains, we all in the same gang\nRunaway slaves all on a chain gang\nBang, bang, bang, bang, bang\n\nHave you lost your mind?\nTell me when you think we crossed the line\nNo more drugs for me, pussy and religion is all I need\nGrab my hand and baby we'll live a hell of a life\n\nOne day I'm gon' marry a porn star\nWe'll have a big-ass crib and a long yard\nWe'll have a mansion and some fly maids\nNothin' to hide, we both screwed the bridesmaids\nShe wanna role play, till I roll over\nI'mma need a whole day, at least rolled doja\nWhat party is we goin' to on Oscar day\n'Specially if she can't get that dress from Oscar de\nLa Renta, they wouldn't rent her, they couldn't take the shame\nSnatched the dress off her back and told her, “Get away”\nHow could you say they live they life wrong\nWhen you never fuck with the lights on?\n\nFuck wit' the lights, fuck wit' the, wit' the lights on\nFuck wit' the lights, fuck wit' the, wit' the lights on\nFuck wit' the lights, fuck wit' the, wit' the lights on\nFuck wit' the lights, fuck wit' the, wit' the lights on\nFuck wit' the lights, fuck wit' the, wit' the lights on\nFuck wit' the lights, fuck wit' the, wit' the lights on\n\nHave you lost your mind?\nTell me when you think we crossed the line\nNo more drugs for me, pussy and religion is all I need\nGrab my hand and baby we'll live a hell of a life\n\nI think I fell in love with a porn star\nAnd got married in a bathroom\nHoneymoon on the dance floor\nAnd got divorced by the end of the night\nThat's one hell of a life","title":"hell_of_a_life"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"Whose fault?\n\n\nLet's play the blame game, I love you more\nLet's play the blame game for sure\nLet's call out names, names, I hate you more\nLet's call out names, names, for sure\n\nI'll call you bitch for short\nAs a last resort, and my first result\nYou call me motherfucker for long\nAt the end of it you know we both were wrong\n\nBut I love to play the blame game, I love you more\nLet's play the blame game for sure\nLet's call her names, names, I hate you more\nLet's call her names, names, for sure\n\n\nOn a bathroom wall I wrote, \"I'd rather argue with you than be with someone else\"\nI took a piss and dismiss it like fuck it and I went and found somebody else\nFuck arguing and harvesting the feelings, yo, I'd rather be by my fucking self\nTill about two AM and I call back and I hang up and I start to blame myself\nSomebody help\n\n\nLet's play the blame game, I love you more\nLet's play the blame game for sure\nLet's call out names, names, I hate you more\nLet's call out names, names, for sure\n\n\nYou weren't perfect but you made life worth it\nStick around, some real feelings might surface\nBeen a long time since I spoke to you in a bathroom\nGripping you up, fucking and choking you\nWhat the hell was I supposed to do?\nI know you ain't getting this type of dick from that local dude\nAnd if you are I hope you have a good time\n'Cause I definitely be having mine\n\nAnd you ain't finna see a mogul get emotional\nEvery time I hear bout other niggas is strokin' you\nLying, say I hit you, he sitting there consoling you\nRunning my name through the mud, who's provoking you?\nYou should be grateful a nigga like me ever noticed you\nNow you noticeable and can't nobody get control of you\nOne AM and can't nobody get a hold of you\nI'm calling your brother's phone like what was I supposed to do?\nEven though I knew, he never told the truth\nHe was just gon' say whatever that you told him to\nAt a certain point I had to stop asking questions\nY'all got dirt on each other like mud wrestlers\nI heard he bought some coke with my money\nThat ain't right girl\nYou getting blackmailed for that white girl\nYou always said, \"Yeezy, I ain't your right girl\nYou'll probably find one of them \"I like art\" type girls\"\nAll of the lights, she-was-caught-in-the-hype girl\nAnd I was satisfied being in love with the lie\nNow who to blame, you to blame, me to blame\nFor the pain and it poured every time when it rained\nLet's play the blame game\n\n\nLet's play the blame game, I love you more\nLet's play the blame game for sure\n\n\n\"Things used to be, now they not\nAnything but us is who we are\nDisguising ourselves as secret lovers\nWe've become public enemies\nWe walk away like strangers in the street\nGone for eternity\nWe erased one another\nSo far from where we came\nWith so much of everything, how do we leave with nothing?\nLack of visual empathy equates the meaning of L-O-V-E\nHatred and attitude tear us entirely\" - Chloe Mitchell\n\nLet's play the blame game, I love you more\nLet's play the blame game for sure\nLet's call out names, names, I hate you more\nLet's call out names, names, for sure\n\nI can't love you this much\nI can't love you this much\nI can't love you this much\nI can't love you this much\nI can't love you this much\nNo, I can't love you this much\nI can't love you this much\nI can't love you this much\n\nAnd I know that you are somewhere doing your thing\nAnd when the phone called it just ring and ring\nYou ain't pick up but your phone accidentally called me back\nAnd I heard the whole thing\nI heard the whole thing, whole thing, whole thing, whole thing\n\n\nOh my God\nBaby you done took this shit to another mother fucking level\nNow a neighborhood nigga like me ain't supposed to be gettin' no pussy like this\nGoddamn, goddamn\nWho taught you how to get sexy for a nigga?\n(Yeezy taught me)\nYou never used to talk dirty, but now you goddamn disgusting\nMy, my God, where'd, where'd you learn that?\n(Yeezy taught me)\nLook at you mother fucking butt ass naked\nWith them motherfucking Jimmy Choos on\nWho taught you how to put some motherfucking Jimmy Choos on?\n(Yeezy taught me)\nYo you took your pussy game up a whole 'nother level\nThis is some Cirque du Soleil pussy now, shit\nYou done went all porno on a nigga, okay? And I, and I love it\nAnd I thank you, I thank you, my dick thanks you!\nHow did you learn, how'd, how did your pussy game come up?\n(Yeezy taught me)\nI was fucking parts of your pussy I'd never fucked before\nI was in there like, \"Oh, shit, I never been here before\"\nI've never even seen this part of pussy town before\nIt's like you got this shit re-upholstered or some shit\nWhat the fuck happened?\nWho, who the fuck got your pussy all reupholstered?\n(Yeezy reupholstered my pussy)\nYou know what, I got to thank Yeezy\nAnd when I see that nigga, I'mma thank him\nI'mma buy the album, I'mma download that motherfucker, I'mma shoot a bootlegger\nThat's how good I feel about this nigga, oh\nI still can't believe you got me this watch\nThis motherfucker is the exact motherfucker I wanted\nEven with the bezel? This is the motherfucker I wanted\nI saw this shit, I saw it, Twista had this shit on in the Source\nI remember, Twista had this motherfucker on in the Source\nThat's right, that's right, yo yo babe, yo yo this is the best birthday ever\nWhere you learn to treat a nigga like this?\n(Yeezy taught me)\nYeezy taught you well, Yeezy taught you well","title":"blame_game"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"I'm up in the woods, I'm down on my mind\nI'm building a still to slow down the time\nI'm up in the woods, I'm down on my mind\nI'm building a still to slow down the time\nI'm up in the woods, I'm down on my mind\nI'm building a still to slow down the time\n\nI'm lost in the world, I'm down on my mind\nI'm new in the city, and I'm down for the night\nDown for the night, said she's down for the night\n\nDown the time\nI'm lost in the world, I'm down on my mind\nI'm new in the city, and I'm down for the night\nDown for the night, said she's down for the night\n\n\nYou're my devil, you're my angel\nYou're my heaven, you're my hell\nYou're my now, you're my forever\nYou're my freedom, you're my jail\nYou're my lies, you're my truth\nYou're my war, you're my truce\nYou're my questions, you're my proof\nYou're my stress and you're my masseuse\nMa ma se, ma ma se, ma ma ku sa\nLost in this plastic life\nLet's break out of this fake-ass party, turn this in to a classic night\nIf we die in each others arms, still get laid in our afterlife\nIf we die in each others arms, still get laid, yeah\n\nI’m up in the woods, been down all my life (Run from the lights, run from the night, run for your life)\nI’m new in the city, down for the night, down for the night, down for the night\nI’m lost in the world, been down my whole life\nI’m new in the city, and I’m down for the night\nDown for the night, down for the night\n\n\nWho will survive in America?\nWho will survive in America?\nWho will survive in America?\nWho will survive in America?\n\nI'm lost in the world, I'm down on my mind\nI'm new in the city, and I'm down for the night\nDown for the night, said she's down for the night\n\nI'm lost in the world, I'm down on my mind\nI'm new in the city, and I'm down for the night\nDown for the night, said she's down for the night","title":"lost_in_the_world"},{"album":"my_beautiful_dark_twisted_fantasy","lyrics":"Us living as we do upside down. \nAnd the new word to have is revolution. \nPeople don't even want to hear the preacher \nspill or spiel because God's whole card has been thoroughly piqued. \nAnd America is now blood and tears instead of milk and honey. \nThe youngsters who were programmed to continue \nfucking up woke up one night digging \nPaul Revere and Nat Turner as the good guys. \nAmerica stripped for bed and we had not all yet closed our eyes.\nThe signs of Truth were tattooed across our open ended vagina. \nWe learned to our amazement untold tale of scandal. \nTwo long centuries buried in the musty vault, \nhosed down daily with a gagging perfume. \nAmerica was a bastard the illegitimate daughter of the mother country \nwhose legs were then spread around the world \nand a rapist known as freedom, free doom. \nDemocracy, liberty, and justice were revolutionary code names \nthat preceded the bubbling bubbling bubbling bubbling bubbling \nin the mother country's crotch\nWhat does Webster say about soul?\nAll I want is a good home and a wife\nand a children and some food to feed them every night.\nAfter all is said and done build a new route to China if they'll have you.\nWho will survive in America?\nWho will survive in America?\nWho will survive in America?\nWho will survive in America?","title":"who_will_survive_in_america"},{"album":"[]","lyrics":"Charlie Wilson - Chorus)\nI know you see me now right now,\n(I know you see me now right now)\nI know you see me now right now (Right now, right now)\nI know you see me now right now (Right now)\nI know you see me now right now\n\n(Beyonce - Hook)\nI got my suit and tie and i dont know if yall know\nWell maybe yall do or maybe yall dont\nBut i dont really care (yeah) \nCus how we on it all the time (uh)\nSo imma get my money lets go\n\n(Kanye - Verse 1)\nNow imma need you to kill the hypocrisy, this an aristocracy\nIm Socrates but my skin more chocolaty\n Thats old news\nIm in a speed boat, in my boat shoes\nHa?\nI swear my whole collection so cruise\nI might walk in nobu, with no shoes\nHe just walked in nobu like it was wholefoods\nThat nigger crazy i told you\nImmatue adult insecure asshole (What else)\nIf you fall on the concrete thats your asphalt\nIf you pass on that Kane beat, thats your last thought\nGet what you ask for i swear thats your ass thought\nShe got a big booty but she couldnt drop that ass low\nSo you take your last hoe and rope up all the cash flow\nWhen you getting money they be all up on your ass yo\nWhen you getting money cuts dont matter cus a nigger past go\nStraight to jail yo, in a hell hole\nRight next to lucifer, tell him i said hello\nAsk if imma be there soon, and tell him i said hell no.\n\nYo what you say when your people get out of jail huh?\n\n(Beyonce)\nMy niggers is home, i guess i got everything\nEverything i want, but i dont\nKnow matter how good it gets it will never be like before\nNo women in the crowd, screaming and its loud\nDoing things not allowed\nAnd i swear its going down right now\nI know one thing my momma would be proud\nAnd you see me looking up\nCus i know shes looking down right now\n\n(Charlie Wilson - Chorus)\nI know you see me now right now,\n\n(I know you see me now right now)\nI know you see me now right now (Right now, right now)\nI know you see me now right now (Right now)\nI know you see me now right now\n\n(Kanye - Verse 2)\nPoor the champagne let your watch show\nShortie got a man watch, wrist look colossal\nI admit my first watch was a fossil\nNow im in the louvre looking for fossils\nAttention to detail is so uncanny\nAnd the whips on this ????? is so uncamrie\nSomebody needs to put us on camera\nThe world of rollies and everyones family\nStay jordan fresh suites and ferraris coupes\nN shortie watch barneys? we head the barneys?\nEnd up at 'mani giorgi and service from sergio pacini\nLamborghini the chain blow off the vertigo\nI know the flow just hit a hella-fied vertical\nThis the cris year, last year was magic 32\nLyricaly cant' none of yall murder Ye' \nCus yall raps aint got no vertebrae\nI got style ask julie she heard in may\nI killt the fur last, Paris rasied the murder rate\nFIrst of all we all know the beats is\nLike a mix between fergie and jeez\nImagine the direction of this immaculate conception\nEveryone of his majesty's swim partys is pageantrys\nCannon ball of the diving board when i am bored\nAll my hommies GD's but i am lord\nRap god, Greek mythology\nAnd this life to crazy to think logicaly\nHeres somthing that you can use an analogy\nMy life is like a childs solutions become reality\n\n(Beyonce)\nNow go get my throne cus i dont wanna stop\nI just go in my zone and imma make it hot\nTill its time to go when its time to go\nWhere you trying to go? you better act like you can see me know\n\n(Charlie Wilson - Chorus)\nI know you see me now right now,\n(I know you see me now right now)\nI know you see me now right now (Right now, right now)\nI know you see me now right now (Right now)\nI know you see me now right now","title":"see_me_now"}]