[{
    "album": "the_life_of_pablo",
    "lyrics": "(Yes, God)\nWe don't want no devils in the house, God (Yes, Lord)\nWe want the lord (Yes, Jesus)\nAnd that's it (Yes, God)\nHallej- hand over Satan (Yes, Jesus)\nJesus praise the Lord (Yes God)\nHallelujah, God (Yes, God)\nWe don't want no devils in the house, God (Yes, Lord)\nWe want the lord (Yes, Jesus)\nAnd that's it (Yes, God)\nHallej- hand over Satan (Yes, Jesus)\nJesus praise the Lord (Yes, God)\n\n\nI'm tryna keep my faith\nWe on an ultralight beam\nWe on an ultralight beam\nThis is a God dream\nThis is a God dream\nThis is everything\nThis is everything\nDeliver us serenity\nDeliver us peace\nDeliver us loving\nWe know we need it\nYou know we need it\nYou know we need it\nThat's why we need you now, oh, I\nPray for Paris\nPray for the parents\nThis is a God dream\nThis is a God dream\nThis is a God dream\nWe on an ultralight beam\nWe on an ultralight beam\nThis is a God dream\nThis is a God dream\nThis is everything\nEverything (Thing, thing, thing)\n\n\nI'm tryna keep my faith\nBut I'm looking for more\nSomewhere I can feel safe\nAnd end my holy war\nI'm tryna keep my faith\n\n\nSo why send depression not blessings?\nWhy, oh why'd you do me wrong? (More)\nYou persecute the weak\nBecause it makes you feel so strong\n(To save) Don't have much strength to fight\nSo I look to the light\n(Lord) To make these wrongs turn right\nHead up high, I look to the light\nHey, cause I know that you'll make everything alright\nAnd I know that you'll take good care of your child\nOh, no longer am afraid of the night\nCause I, I look to the light\n\n\nWhen they come for you, I will shield your name\nI will field their questions, I will feel your pain\nThey don't know, they don't\nThey don't know, they don't know\nFoot on the Devil's neck 'til they drifted Pangaea\nI'm moving all my family from Chatham to Zambia\nTreat the demons just like Pam\nI mean I fuck with your friends, but damn, Gina\nI been this way since Arthur was anteater\nNow they wanna hit me with the woo wap the bam\nTryna snap photos of familia\nMy daughter look just like Sia, you can't see her\nYou can feel the lyrics and spirit coming in braille\nTubman of the underground, come and follow the trail\nI made Sunday Candy, I'm never going to hell\nI met Kanye West, I'm never going to fail\nHe said let's do a good ass job with Chance three\nI hear you gotta sell it to snatch the Grammy\nLet's make it so free and the bars so hard\nThat there ain't one gosh darn part you can't tweet\nThis is my part, nobody else speak\nThis is my part, nobody else speak\nThis little light of mine\nGlory be to God, yeah\nI'mma make sure that they go where they can't go\nIf they don't wanna ride I'mma still give them raincoats\nKnow what God said when he made the first rainbow\nJust throw this at the end if I'm too late for the intro\nUgh, I'm just having fun with it\nYou know that a nigga was lost\nI laugh in my head\nCause I bet that my ex looking back like a pillar of salt\nUgh, cause they'll flip the script on your ass like Wesley and Spike\nYou cannot mess with the light\nLook at lil Chano from 79\n\nWe on an ultralight beam\nWe on an ultralight beam\nThis is a God dream\nThis is a God dream\nThis is everything\nEverything\n\n(Yes, God\nHallelujah)\nI'm tryna keep my faith\n(Yes, Jesus)\nBut I'm looking for more\nSomewhere I can feel safe\nAnd end my holy war\n\nFather, this prayer is for everyone that feels they're not good enough. This prayer's for everybody that feels like they're too messed up. For everyone that feels they've said \"I'm sorry\" too many times. You can never go too far when you can't come back home again. That's why I need...\nFaith, more, safe, war",
    "title": "ultralight_beam"
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": "the_life_of_pablo",
    "lyrics": "Man I can understand how it might be\nKinda hard to love a girl like me\nI don't blame you much for wanting to be free\nI just wanted you to know\nSwizz told me let the beat rock\n\nFor all my Southside niggas that know me best\nI feel like me and Taylor might still have sex\nWhy? I made that bitch famous\nGod damn\nI made that bitch famous\nFor all the girls that got dick from Kanye West\nIf you see 'em in the streets give 'em Kanye's bests\nWhy? They mad they ain't famous\nGod damn\nThey mad they're still nameless\n(Talk that talk man)\nHer man in the store tryna try his best\nBut he just can't seem to get Kanye fresh\nBut we still hood famous\nGod damn\nYeah we still hood famous\n\nI just wanted you to know\nI loved you better than your own kin did\nFrom the very start\nI don't blame you much for wanting to be free\nWake up, Mr West\nI just wanted you to know\n\nI be Puerto Rican day parade floatin'\nThat Benz Marina Del Rey coastin'\nShe be Puerto Rican day parade wavin'\nLast month I helped her with the car payment\nYoung and we alive, whoo!\nWe never gonna die, whoo!\nI just copped a jet to fly over personal debt\nPut one up in the sky\nThe sun is in my eyes, whoo!\nWoke up and felt the vibe, whoo!\nNo matter how hard they try, whoo!\nWe never gonna die\n\nI just wanted you to know\n\nBam bam, bam bam\nBam bam dilla, bam bam\n'ey what a bam bam\nHow you feeling right now, let me see you ladies in the air\nBam bam dilla, bam bam\nBam bam eh\nBam bam, bam bam\nLet me see your middle finger in the air\nBam bam, bam bam\nBam bam dilla, bam bam\nLet me see you act up in this mother fucker\n'ey what a bam bam\nBam bam dilla, bam bam\nHow you feelin', how you feelin, how you feelin' in this mother fucker, god damn\nBam bam\nOne thing you can't do it stop us now\nBam bam, bam bam\nBam bam dilla, bam bam\nYou can't stop the thing now\n'ey what a bam bam\nMan it's way too late, it's way too late, it's way too late you can't\nBam bam dilla, bam bam\nBam bam, bam bam\nBam bam, bam bam\nTo the left, to the right\nBam bam dilla, bam bam\nI wanna see everyone's hands in the air like this\n'ey what a bam bam\nBam bam, bam bam\nBam bam dilla, bam bam\n\nI just wanted you to know\nI loved you better than your own kin did\nFrom the very start\nI don't blame you much for wanting to be free\nI just wanted you to know",
    "title": "famous"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "Ayy, y'all heard about the good news?\nY'all sleeping on me, huh? Had a good snooze?\nWake up, nigga, wake up\nWe bout to get this paper\n\nMoney never made me\nMake me do something? Nah, can't make me\nEven if the money low, can't pay me\nEven if the money low, can't play me\n\nAyy, y'all heard about the good news?\nY'all sleeping on me, huh? Had a good snooze?\nWake up, nigga, wake up\nWe bout to get this paper\n\nPablo bought a Roley and a rottweiler\nSeem like the more fame, I only got wilder\nHands up, we just doing what the cops taught us\nHands up, we just doing what the cops taught us\nI've been outta my mind a long time\nI've been outta my mind a long time\nI’ve been saying how I feel at the wrong time\nMight not come when you want but I'm on time\n\nAyy, y'all heard about the good news?\nY'all sleeping on me, huh? Had a good snooze?\nWake up, nigga, wake up\nWe 'bout to get this paper\n\nI can’t let these people play me\nName one genius that ain't crazy\nFollow our father\nYou borrow our motto\nI'm a Chicago south sider\nI'm a Chicago south sider\n\nAyy, y'all heard about the good news?\nY'all sleeping on your boy, had a good snooze?\nWake up, nigga, wake up\nIt's time to get the paper\n\nI've been outta my mind a long time\nI've been outta my mind a long time\nI know, I know, I shouldn’t even bother\nWith all these gossiping, no-pussy-getting bloggers\nFashion show in Gotham, I need another costume\nPETA's mad cause I made a jacket outta possum\nAwesome, Steve Jobs mixed with Steve Austin\nRich slave in the fabric store picking cotton\nIf Hov J then every Jordan need a Rodman\nMan, Jay, they don't really want no problems\nDriving in the same car that they killed Pac in\nDriving in the same uh that they killed Pac in\nHands up, we just doing what the cops taught us\nHands up, hands up, then the cops shot us\n\nHold on, hold on, hold on\nWait a second, everybody here, I'm the ghetto Oprah\nYou know what that mean? You get a fur! You get a fur!\nYou get a jet! You get a jet! Big booty bitch for you! Woo!",
    "title": "feedback"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "You want me to give you a testimony about my life, and how good he's been to me. I don't know what to tell you about him, I love him so much with all my heart and my soul with every bone in my body I love him so much because he's done so much for me. \n\nEvery morning, every day of my life. I won't always be crying tears in the middle of the night, and I won't always have to wake up by myself wondering how I'm gonna get through the day. I won't always have to think about what I'm gonna do and how I'm gonna, how I'm gonna make it, how I'm gonna get there, because he... he's gonna be there for me. Some day the sky above will open up and he will reach out his hand and guide me through, oh yes he will. I won't always be crying these tears. I won't always be feeling so blue. Some day, he will open up the door for me and call my name. Some day he will. I don't know if anybody understands what that feels like.\n\nNo matter what you've been through or where you've been he's always there, with his arms open wide accepting me for who I am and I love him so much, I couldn't do it without him I wouldn't want to. I'm crying now, it feels so good to be free, to be accepted for who you are and loved no matter what, oh lord thank you, you are the joy of my life.",
    "title": "low_lights"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "[Young Thug and Kanye West]\nHigh lights\nTell my baby I'm back in town\nHigh lights\nTell everybody I'm back in town\nHigh lights\nTell my baby I'm back in town\nHigh lights\nWe only makin' the highlights\nTell my mama, tell my mama, that I only want my whole life to only be highlights\nWe only makin' the highlights\nTell my mama, tell my mama, that I only want my whole life to only be highlights\nCan we play that back one time?\nAnd after that night I'm gon' wanna play shit back, I don't know\nSometimes I'm wishin' that my dick had GoPro\nSo I could play that shit back in slo-mo\nI just shot an amateur video; I think I should go pro\nWe only makin' the highlights\nWe only makin' the highlights\nTell my mama, tell my mama, that I only want my whole life to be mine\n\n\nOne life, one night\nHigh lights\nLivin' the life 'til I die\n\nI bet me and Ray J would be friends\nIf we ain't love the same bitch\nYeah, he might have hit it first\nOnly problem is I'm rich\nUh\n21 Grammys, superstar family\nWe the new Jacksons, I'm all about that action\nI'm about that Farrakhan\nLife is a marathon\nI'ma shift the paradigm\nI'ma turn up every time\nI'ma bust a coach's head open on some Diddy shit\nIf he ever talk to my son like an idiot\nOne time for a nigga really gettin' it\nTwo times cause we got the whole city lit\nAdvice to all my niggas, impregnate Bridget\nSoon as she have a baby she gon' make another nigga\nGot the Fruit of Islam and the trenches hah?\nEven though they know Yeezus is a Christian hah?\nShe spent her whole check on some Christians\nAnd that girl ain't even religious\nWalkin', livin', breathin', girl you know my past well\nHard to believe in God, your nigga got killed\nBlac Chyna fuckin' Rob, help him with the weight\nI wish my trainer would, tell me what I overate\nSo when I'm on vacay, I need to kick back\nWhat you want?\nYou want a boss or an R&B nigga with a six pack?\nI need every bad bitch up in Equinox\nI need to know right know if you a freak or not\nI need every bad bitch up in Equinox\nI need to know right know if you a freak or not\n\n\nI need every bad bitch up in Equinox\nI want to know right know if you a freak or not\nI need every bad bitch up in Equinox\nI want to know right know if you a freak or not\nOh lord, oh lord\nI need every bad bitch up in Equinox\nI want to know right know if you a freak or not\nBad bitch up in Equinox\nI want to know right know if you a freak or not\nOh lord, oh lord",
    "title": "highlights"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "This that rap god shit nigga\nI rip every one of these motherfuckers down\nAye, rah, rah, rah\nRah, rah\n\nClose eyes, see things\nFire up, tweaking\nYou're my freak dreams\nYou're my freak dreams\nBad bitch, you dig that\nGet stacks, drive cars\nWhip out, bitch out\nTits out, oh shit\nMy dick out, can she suck it right now?\nFuck, can she fuck right now?\nI done asked twice now\nCan you bring your price down?\nLil Boosie with the wipe down\nA little woozy but I'm nice now\nWhat the fuck right now?\nWhat the fuck right now?\nWhat the, what the fuck right now?\nWhat if we fuck right now?\nWhat if we fucked right in the middle\nOf this motherfuckin' dinner table?\nWhat if we just fucked at the Vogue party\nWould we be the life of the whole party?\nShut down the whole party\nWould everybody start fuckin'?\nWould everybody start fuckin'?\nWould everybody start fuckin'? They don't want nothin'\nYou motherfuckers living like half of your level, half of your life\nI smack her on her ass if she ghetto, I ain't gon' lie\nWe be in the bathroom fucking like baby don't get too loud\nI can, I can sing it, yeah\n\n\nI want it right now\nAll of my niggas gon' get it in Chi now\nYou get hit with the pie now\nRolls with killer money nigga get by now\nRight now, right now\nI'm with niggas that have been to your side now\nSide now, side down",
    "title": "freestyle_4"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "I miss the old Kanye, straight from the 'Go Kanye\nChop up the soul Kanye, set on his goals Kanye\nI hate the new Kanye, the bad mood Kanye\nThe always rude Kanye, spaz in the news Kanye\nI miss the sweet Kanye, chop up the beats Kanye\nI gotta to say at that time I'd like to meet Kanye\nSee I invented Kanye, it wasn't any Kanyes\nAnd now I look and look around and there's so many Kanyes\nI used to love Kanye, I used to love Kanye\nI even had the pink polo, I thought I was Kanye\nWhat if Kanye made a song about Kanye\nCalled \"I Miss The Old Kanye,\" man that would be so Kanye\nThat's all it was Kanye, we still love Kanye\nAnd I love you like Kanye loves Kanye",
    "title": "i_love_kanye"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "Turn it up!\n\nStep up in this bitch like (turn it up!)\nI'm the one your bitch like\nYeah I'm the one your bitch like\nAnd I be talkin' shit like\nI ain't scared to lose a fistfight\nAnd she grabbin' on my dick like\nShe wanna see if it'll fit right\nThat's just the wave\n\nWaves don't die\nLet me crash here for the moment\nI don't need to own it\nNo lie\nWaves don't die, baby\nLet me crash here for a moment\nBaby I don't, I don't need to own...\n\nSun don't shine in the shade (turn it up!)\nBird can't fly in a cage (turn it up!)\nEven when somebody go away (turn it up!)\nThe feelings don't really go away\nThat's just the wave (yeah)\n\nWaves don't die\nLet me crash here for the moment\nI don't need to own it\nNo lie\nWaves don't die, baby\nLet me crash here for a moment\nBaby I don't, I don't need to own you\n\nNo lie\nNo lie\nNo lie\nYou set the night on fire\nI'm still gon' be here in the morning\nNo lie\n\nNo lie\nOoh baby, ooh baby\nYou set the night on fire\nI'm still gon' be here in the morning\nNo lie",
    "title": "waves"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "I been waiting for a minute\nFor my, lady\nSo I can't jeopardize that for one of these hoes\nI been living without limits\nAs far as my business\nI'm the only one that's in control\nI been feeling all I've given\nFor my children\nI will die for those I love\nGod, I'm willing\nTo make this my mission\nGive up the women\nBefore I lose half of what I own\nI been thinking\nAbout my vision\nPour out my feelings\nRevealing the layers to my soul, my soul\nThe layers to my soul\nRevealing the layers to my soul\n\nThey wish I would go ahead and fuck my life up\nCan't let them get to me\nAnd even though I always fuck my life up\nOnly I can mention me\n\nSee, before I let you go\nOne last thing I need to let you know\nYou ain't never seen nothing crazier than\nThis nigga when he off his Lexapro\nRemember that last time in Mexico\nRemember that last time, the episode\nAsking me why the hell I text in code\nFour times that you say don't text me hoe\nTold you four times, don't test me, hoe\nNow we finna lose all self-control\nBut you ain't finna be raising your voice at me\nEspecially when we in the Giuseppe store\nBut I'mma have the last laugh in the end\nCause I'm from a tribe called check a hoe\nYeah, I'mma have the laugh in the end\nCause I'm from a tribe called check a hoe\nAnd I...\n\nThey wish I would go ahead and fuck my life up\nCan't let them get to me\nAnd even though I always fuck my life up\nOnly I can mention me\nThey wish I would go ahead and fuck my life up\nCan't let them get to me\nAnd even though I always fuck my life up\nOnly I can mention me\n\nSee through the veil\nAnd forget all of your cares\nThrow them, throw them away\nDon't stop your loving\nDon't stop for nothing\nNo, not for nothing\nThey don't wanna see me love you\nNah, don't stop it\nThey always love it\nThey always wanna\nThey don't wanna see me love you\nThey don't wanna see me love you\nThey don't wanna see me love you\nThey don't wanna see me love you\nSee through the veil\nAnd forget all your cares\nThrow them, throw them away\nOh, life's a feeling\nOh, the body's a feeling",
    "title": "fml"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "Real friends, how many of us?\nHow many of us, how many jealous? Real friends\nIt's not many of us, we smile at each other\nBut how many honest? Trust issues\nSwitched up the number, I can't be bothered\nI cannot blame you for havin' an angle\nI ain't got no issues, I'm just doin' my thing\nHope you're doin' your thing too\nI'm a deadbeat cousin, I hate family reunions\nFuck the church up by drinkin' after communion\nSpillin' free wine, now my tux is ruined\nIn town for a day, what the fuck we doin'?\nWho your real friends? We all came from the bottom\nI'm always blamin' you, but what's sad, you not the problem\nDamn I forgot to call her, shit I thought it was Thursday\nWhy you wait a week to call my phone in the first place?\nWhen was the last time I remembered a birthday?\nWhen was the last time I wasn't in a hurry?\n\nTell me you want your tickets when it's gametime\nEven to call your daughter on her FaceTime\nEven when we was young I used to make time\nNow we be way too busy just to make time\nEven for my...\n\nReal friends\nI guess I get what I deserve, don't I?\nWord on the streets is they ain't heard from him\nI guess I get what I deserve, don't I?\nTalked down on my name, throwed dirt on him\n\nI couldn't tell you how old your daughter was\nCouldn't tell you how old your son is\nI got my own Jr. on the way, dawg\nPlus I already got one kid\nCouldn't tell you much about the fam though\nI just showed up for the yams though\nMaybe 15 minutes, took some pictures with your sister\nMerry Christmas, then I'm finished, then it's back to business\nYou wanna ask some questions 'bout some real shit?\nLike I ain't got enough pressure to deal with\nPlease don't pressure me with that bill shit\nCause everybody got 'em, that ain't children\nOh you've been nothin' but a friend to me\nNiggas thinkin' I'm crazy, you defendin' me\nIt's funny I ain't spoke to niggas in centuries\nTo be honest, dawg, I ain't feelin' your energy\nMoney turn your kin into an enemy\nNiggas ain't real as they pretend to be\n\nLookin' for all my real friends\nHow many of us? How many of us are real friends\nTo real friends, 'til the reel end\n'Til the wheels fall off, 'til the wheels don't spin\nTo 3 A.M., callin'\nHow many real friends?\nJust to ask you a question\nJust to see how you was feelin'\nHow many?\nFor the last you was frontin'\nI hate when a nigga text you like, \"what's up, fam, hope you good\"\nYou say, \"I'm good\" then great, the next text they ask you for somethin'\nHow many?\nWhat's best for your family, immediate or extended\nAny argument, the media'll extend it\nI had a cousin that stole my laptop that I was fuckin' bitches on\nPaid that nigga 250 thousand just to get it from him\nReal friends\nHuh?\n\nReal friends\nI guess I get what I deserve, don't I\nWord on the streets is they ain't heard from him\nI guess I get what I deserve, don't I\nTalked down on my name, throwed dirt on him",
    "title": "real_friends"
}, {
    "album": "the_life_of_pablo",
    "lyrics": "Lost out, beat up\nDancin', down there\nI found you, somewhere out\n'Round 'round there, right right there\nLost and beat up\nDown there, dancin'\nI found you, somewhere out\nRight down there, right 'round there\n\nLost and, found out\nTurned out, how you thought\nDaddy, found out\nHow you turned out, how you turned out\nIf mama knew now\nHow you turned out, you too wild\nYou too wild, you too wild\nYou too wild, I need you now\nGot to love you\nFound you, found you\nRight now, right now\nRight now, right now\nIf your mama knew how\nYou turned out, you too wild\nYou too wild, you too wild\nYou too wild, and I need you now\nLost and found now\n\nYou gotta let me know if I could be your Joseph\nOnly tell you real shit, that's the tea, no sip\nDon't trip, don't trip, that pussy slippery, no whip\nWe ain't trippin' on shit, we just sippin' on this\nJust forget the whole shit, we could laugh about nothin'\nI impregnate your mind, let's have a baby without fuckin', yo\nI know it's corny bitches you wish you could unfollow\nI know it's corny niggas you wish you could unswallow\nI know it's corny bitches you wish you could unfollow\nI know it's corny niggas you wish you could unswallow\nI know it's corny bitches you wish you could unfollow\nI know it's corny niggas you wish you could unswallow\nYou tried to play nice, everybody just took advantage\nYou left your fridge open, somebody just took a sandwich\nI said baby what if you was clubbin'\nThuggin', hustlin' before you met your husband?\nThen I said, \"What if Mary was in the club\nWhen she met Joseph around hella thugs?\nCover Nori in lambs' wool\nWe surrounded by the fuckin' wolves\"\n\"What if Mary was in the club\n'Fore she met Joseph with no love?\nCover Saint in lambs' wool\nWe surrounded by the fuckin' wolves\"\n\n\nThe rings all ring out\nBurn out, cave in\nBlackened to dark out\nI'm mixed now, fleshed out\nThere's light with no heat\nWe cooled out, it's cool out\nLife is precious\nWe found out, we found out\nWe found out",
    "title": "wolves"
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": "the_life_of_pablo",
    "lyrics": "Baby lion goes\nWhere the islands go\n\nYou say you never saw this comin', well you're not alone\nMillion dollar renovations to a happy home\nMy ex says she gave me the best years of her life\nI saw a recent picture of her, I guess she was right\nI wake up, assessin' the damages\nCheckin' MediaTakeOut\nPictures of me drunk walkin' out with a bitch\nBut it's blurry enough to get the fake out\nI wake up, all veggies no eggs\nI hit the gym, all chest no legs\nYep, then I made myself a smoothie\nYeah, then me and wifey make a movie\nChicago - St. Louis, St. Louis to Chicago\nÁndale Ándale E.I, E.I, uh, oh\nYou had me drivin' far enough to switch the time zone\nYou was the best of all time at the time though\nYeah, you wasn't mine though\n\nBut I still drove 30 hours\nBut still drove 30 hours to you\n\nI remember rapping for Jay and Cam\nYoung producer just trying to get his flows off\nI remember being nervous to do Victoria Secret\n'Til I pictured everybody with they clothes off\nExpedition was Eddie Bauer edition\nI'm drivin' with no winter tires in December\nSkrrt skrrt skrrt like a private school for women\nThen I get there and all the Popeye's is finished, girl\nYou don't love me, you just pretendin'\nI need that happy beginnin', middle and endin'\nChicago, St. Louis, St. Louis to Chicago\nIt's gettin' hot in hurr, that's all that I know\nGot a hotel room, 3 stars for you\nYou call down for an omelet\nGirl it's 5 in the morning\nYou realize we at the DoubleTree, not the Aria\nOnly thing open is Waffle House, girl don't start with me\nI used the Western Union for you like it's no prob\nCause you was in college complainin' about it's no jobs\nBut you were suckin' a nigga's dick the whole time\nWell I guess a blowjob's better than no job\n\nAnd I drove back 30 hours\n\nWere remains that long to lose sad\nBetter unsaid\nAlways turn, oh\n\n3 Stacks, can you help me out?\n30 hours\nYeah, this the type of shit you ride out to\n30 hours\n30 hours\nI just be like, it was my idea to have an open relationship\nNow a nigga mad\nNow I'm 'bout to drive 90 miles like Matt Barnes to kill...\n30 hours\nJust to kill..\nJust to...\nJust to...\nI'm about to drive 90\n90 miles like Matt Barnes just to whoop a nigga ass\nIt was my idea and now a nigga\n30 hours\nNow a nigga mad, now a nigga, uh\nA stunna\nWhoop him after school just to show I got class\nDuh-duh-duh-duh-duh-duh-duh-duh\nDuh-duh with you, yeah\n30 hours\nYou know what I'm sayin'? Drop some shit like that\nAy, woop him after school\n30 hours\nWhoop him after school just to show I got class\nUh, 3 Stacks\n30 hours\nJust ride out to that\nCheck it out, this the bonus track, this the bonus\nMy favorite albums just have like bonus joints like this\nThat's why they kick it off like this\nJust did that Madison Square Garden\n30 hours\nHad to put the flyest nigga on this shit\nThe pyramids shall rise\n30 hours\nLook at all these Ultralight Beams flowin'\nFor all the moms, dads, the kids, the families that shared this moment with us\nLet's rock out for 'bout\n30 hours\nYou know, ay you know\nAy, you know, ay, you know\n30 hours\nWhole design team, Yeezy team, music team\nRemember when the whole block'd get shout out?\nThis my version of a shout out track\n30 hours\nLet that mothafucka rock, let that, let that, yeah\nTo my brother Yasiin, holding it out in Africa\n30 hours\nTo my family, thank you for holding me down\nThe media be after us\n*Phone call*\nThat's Gabe calling\nYo Gabe\nI'm just doing a... just doing an adlib track right now\nWhat's up?\n30 hours",
    "title": "30_hours"
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": "the_life_of_pablo",
    "lyrics": "Your love is fadin'\nYour love is fadin'\nYour love is fadin'\nI feel it's fadin'\n\nWhen no one ain't around\nI feel it's fadin'\nI think I think too much\nI feel it's fadin'\nAin't nobody watchin'\nI feel it's fadin'\nI just fade away\n\nI feel it\nFade away\nI feel it\nI feel it\nFade away-ay-ay-ay\nI think I think too much\nI feel it\nYour love is fadin'\nI feel it\n\nRoll up, roll up\nHold up, hold up\nPo' up, po' up\nI feel it\nI love to\nI wanna\nI'm tryna\nI feel it\nI'ma rock the boat\nWork the middle 'til it hurt a little\nI feel it\nYour love is fadin'\nI feel it\n\nFuckin' with a real ass nigga\nI feel it\nFuck how you feel ass nigga\nI feel it\nBitch better act like you know better\nI feel it\nWoah\n\nWhen no one ain't around\nI feel it's fadin'\nI think I think too much\nI feel it's fadin'\nAin't nobody watchin'\nI feel it's fadin'\nI just fade away\nI feel it's fadin'\n\nYou don't even know\nI've been so far gone\nI feel it\nI've been so led on\nI've been runnin' 'round\nI feel it\nI've been on my shit\nWhole world on my dick\nI feel it\nI just need to know\nI can feel it\n\nOh, deep inside\nDeep, deep, down inside\nI feel it\nYes, deep inside\nDeep, deep, down inside\nI feel it\nOh, deep inside\nDeep, deep, down inside\nI feel it\nYes, deep inside\nI get lifted, yes\nDeep, deep, down inside\nI can feel it\nOh, deep inside\nOh, I get lifted, yes\nDeep, deep, down inside\nI feel it\nYes, deep inside\nOh, I get lifted, yes\nDeep, deep, down inside\nI feel it\nOh, deep inside\nOh, I get lifted, yes\nDeep, deep, down inside\nI feel it\nYes, deep inside\nOh, I get lifted, yes\nDeep, deep, down inside\nI get\nI feel it's fadin'\nOh, I get lifted, yes\n\nI feel it's fadin'\nI feel it's fadin'\nI feel it\nI feel it's fadin'",
    "title": "fade"
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}]
