[{
    "album": "yeezus",
    "lyrics": "Yeezy season approaching\nFuck whatever y'all been hearing\nFuck what, fuck whatever y'all been wearing\nThe monster about to come alive again\n\nSoon as I pull up and park the Benz\nWe get this bitch shaking like Parkinsons\nTake my number and lock it in\nIndian hair, no moccasins\n\nIt's too many hoes in this house of sin\nReal nigga back in the house again\nBlack Timbs all on your couch again\nBlack dick all in your spouse again\nAnd I know she like chocolate men\nShe got more niggas off than , huh\n\nOn sight\nOn sight\n\nHow much you wanna give a fuck?\nLet me show you right now before you give it up\nHow much do I not give a fuck?\nLet me show you right now before you give it up\n\n\n\nBaby girl tryna get a nut\nAnd her girl tryna give it up\nChopped 'em both down\nDon't judge 'em, \n\nOne last announcement\nNo sports bra, lets keep it bouncin'\nEverybody wanna live at the top of the mountain\nTook her to The Bleau she tried to sip the fountain\nThat when David Grutman kicked her out\nBut I got her back in and put my dick in her mouth\n\nOn sight\nOn sight\nUh\nUh-huh\nUh-huh\n\nRight now\nI need, right now\nI need, I need, right now\nRight now\nI need, I need, right now",
    "title": "on_sight"
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": "yeezus",
    "lyrics": "Blazin', mi don't want dem\nMi need dem\nBlazin'\n\nSuh mi tek har outta bugah red and put her in a tall skirt\nAnd now she find out what life is really worth\nNo to X rated\n\nYo mi tek har outta bugah red and put her in a tall skirt\nAnd now she find out what life is really worth\nNo to X rated\n\n\nI am a god\nI am a god\nI am a god\n\nI am a god\nHurry up with my damn massage\nHurry up with my damn ménage\nGet the Porsche out the damn garage\nI am a god\nEven though I'm a man of God\nMy whole life in the hand of God\nSo y'all better quit playin' with God\n\nSoon as they like you make 'em unlike you\n'Cause kissin' people ass is so unlike you\nThe only rapper compared to Michael\nSo here's a few hatin'-ass niggas to fight you\nAnd here's a few snake-ass niggas to bite you\nAnd I don't even wanna hear 'bout what niggas might do\nOld niggas mentally still in high school\nSince the tight jeans they ain't never liked you\nPink-ass polos with a fuckin' backpack\nBut everybody know you brought real rap back\nNobody had swag, man, we the Rat Pack\nVirgil, Pyrex, Don C snapback\nIbn diamond, Chi-town shinin'\nMonop' in this bitch again, changed the climate\nHop in this bitch again, same thing I'm in\nUntil the day I get struck by lightning\n\nI am a god\nSo hurry up with my damn massage\nIn a French-ass restaurant\nHurry up with my damn croissants\n\nI am a god\nI am a god\nI am a god\n\nAhh\nAhh\n\nI just talked to Jesus\nHe said, \"What up, Yeezus?\"\nI said, \"Shit I'm chillin'\nTryna stack these millions\"\nI know he the most high\nBut I am a close high\nMi casa, su casa\nThat's our cosa nostra\n\nI am a god\nI am a god\nI am a god\n\nAhh\nAhh\nAhh\nAhh\n\n\nAin't no way I'm givin' up\nI'm a god",
    "title": "i_am_a_god"
}, {
    "album": "yeezus",
    "lyrics": "My mama was raised in the era when\nClean water was only served to the fairer skin\nDoing clothes you would have thought I had help\nBut they wasn't satisfied unless I picked the cotton myself\nYou see it's broke nigga racism, that's that \"Don't touch anything in the store\"\nAnd this rich nigga racism, that's that \"Come in, please buy more\nWhat you want, a Bentley? Fur coat? A diamond chain?\nAll you blacks want all the same things\"\nUsed to only be niggas now everybody playing\nSpending everything on Alexander Wang, new slaves\n\nYou see it's leaders and it's followers\nBut I'd rather be a dick than a swallower\nYou see it's leaders and it's followers\nBut I'd rather be a dick than a swallower\n\nI throw these Maybach keys, I wear my heart on the sleeve\nI know that we the new slaves, I see the blood on the leaves\nI see the blood on the leaves, I see the blood on the leaves\nI know that we the new slaves, I see the blood on the leaves\nThey throwing hate at me, want me to stay at ease\nFuck you and your corporation, y'all niggas can't control me\nI know that we the new slaves, I know that we the new slaves\nI'm 'bout to wild the fuck out, I'm going Bobby Boucher\nI know that pussy ain't free, you niggas pussy, ain't me\nY'all throwing contracts at me, you know that niggas can't read\nThrow 'em some Maybach keys, fuck it, c'est la vie\nI know that we the new slaves, y'all niggas can't fuck with me\nY'all niggas can't fuck with Ye, y'all niggas can't fuck with Ye\nI'll move my family out the country, so you can't see where I stay\nSo go and grab the reporters, so I can smash their recorders\nSee they'll confuse us with some bullshit like the New World Order\nMeanwhile the DEA, teamed up with the CCA\nThey tryna lock niggas up, they tryna make new state\nSee that's that privately owned prison, get your piece today\nThey prolly all in the Hamptons, bragging 'bout what they made\nFuck you and your Hampton house, I'll fuck your Hampton spouse\nCame on her Hampton blouse and in her Hampton mouth\nY'all 'bout to turn shit up, I'm 'bout to tear shit down\nI'm 'bout to air shit out, now what the fuck they gon' say now?\n\nI won't end this high, not this time again\nSo long, so long, so long, you cannot survive\nAnd I'm not dyin', and I can't lose\nI can't lose, no, I can't lose\n'Cause I can't leave it to you\nSo let's get too high, get too high again\n\n\nToo high again, too high\nOoh, ooh, ooh\nToo high, yeah\n\n\nEgyszer a nap úgy elfáradt\nElaludt mély zöld tó ölén\nAz embereknek fájt a sötét\nŐ megsajnált, eljött közénk\nIgen",
    "title": "new_slaves"
}, {
    "album": "yeezus",
    "lyrics": "I can hold my liquor\nBut this man can’t handle his weed\nDark and lonely now\nOn Chicago, south of town\nI'm on to Indiana\nI heard it in the radio now\n\n\nI can't handle no liquor\nBut these bitches can't handle me\nI can't control my niggas\nAnd my niggas they can't control me\nYou say you know me, my nigga\nBut you really just know the old me\n\n\nBitch, I'm back out my coma\nWakin' up on your sofa\nWhen I park my Range Rover\nSlightly scratch your Corolla\nOkay, I smashed your Corolla\nI'm hangin' on a hangover\nFive years we been over\nAsk me why I came over\nOne more hit and I can own ya\nOne more fuck and I can own ya\nOne cold night in October\nPussy had me floatin'\nFeel like Deepak Chopra\nPussy had me dead\nMight call 2Pac over\nYeezy's all on your sofa\nThese the Red Octobers\nStill ain't learn me no manners\nYou love me when I ain't sober\nYou love me when I'm hungover\nEven when I blow doja\nThen her auntie came over\nSkinny bitch with no shoulders\nTellin' you that I'm bogus\nBitch you don't even know us\n\"Baby girl, he's a loner\nBaby girl, he's a loner\nLate-night organ donor\nAfter that, he disown ya\nAfter that he's just hopeless\nSoul mates become soulless\nWhen it's over it's over\"\nAnd bitch, I'm back out my coma\n\n\nCallin' up your uncle's place\nShit's all over the place\nI don't hear your phone\nOh, I wanna phone home\n\n\nI can't handle no liquor\nBut these bitches can't handle me\nI can't control my niggas\nAnd my niggas they can't control me\nYou say you know me, my nigga\nBut you really just know the old me\n\n\nI heard you need a new fad (A new girl)\nI heard you need a new stack (A new girl)\nI heard you need a new phone (A new girl)\nI know your 'rents ain't be home (A new girl)\n\n\nCallin' up your uncle's place\nShit's all over the place\nI don't hear your phone\nOh, I wanna phone home",
    "title": "hold_my_liquor"
}, {
    "album": null,
    "lyrics": null,
    "title": null,
    "year": null
}, {
    "album": "yeezus",
    "lyrics": "Strange fruit hangin' from the poplar trees\nBlood on the leaves\n\n\nI just need to clear my mind now\nIt's been racin' since the summertime (Breeze)\nNow I'm holdin' down the summer now (Breeze)\nAnd all I want is what I can't buy now (Blood on the leaves)\nCause I ain't got the money on me right now\nAnd I told you to wait (Breeze)\nYeah, I told you to wait (Breeze)\nSo I'mma need a little more time now (Blood on the leaves)\n'Cause I ain't got the money on me right now\nAnd I thought you could wait (Breeze)\nYeah, I thought you could wait (Breeze)\nThese bitches surroundin' me (Black bodies)\nAll want something out me (Hangin' in the summer breeze)\nThen they talk about me (Breeze)\nWould be lost without me\nWe could've been somebody (Strange fruit)\nThought you'd be different 'bout it (Hangin')\nNow I know you not it (From the poplar trees)\nSo let's get on with it (From the poplar trees)\n\nWe could've been somebody\n'Stead you had to tell somebody\nLet's take it back to the first party\nWhen you tried your first molly\nAnd came out of your body\nAnd came out of your body\nRunning naked down the lobby\nAnd you was screamin' that you love me\nBefore the limelight tore ya\nBefore the limelight stole ya\nRemember we were so young\nWhen I would hold you\nBefore the blood on the leaves (Black bodies hangin' in the summer breeze, breeze)\nI know there ain't wrong with me (Strange fruit hangin')\nSomething strange is happenin' (From the poplar trees)\n(From the poplar trees)\n\n\nYou could've been somebody\nWe could've ugh, we could've been somebody\nOr was it on the first party\nWhen we tried our first molly\nAnd came out of our body\nAnd came out of our body\nBefore they call lawyers\nBefore you tried to destroy us\nHow you gon' lie to the lawyer?\nIt's like I don't even know ya\nI gotta bring it back to the 'nolia\n\n\nFuck them other niggas 'cause I'm down with my niggas (Black bodies)\nFuck them other niggas 'cause I'm down with my niggas (Hangin' in the summer breeze)\nFuck them other niggas 'cause I'm down with my niggas (Breeze)\nI ride with my niggas, I'd die for my\n(From the poplar trees)\n(From the poplar trees)\n\n\nTo all my second string bitches, try and get a baby\nTrying to get a baby, now you talkin' crazy\nI don't give a damn if you used to talk to Jay Z\nHe ain't with you, he with Beyoncé, you need to stop actin' lazy\nShe Instagram herself like #BadBitchAlert\nHe Instagram his watch like #MadRichAlert\nHe only wanna see that ass in reverse\nTwo-thousand-dollar bag with no cash in your purse\nNow you sittin' courtside, wifey on the other side\nGotta keep 'em separated, I call that apartheid\nThen she said she impregnated, that's the night your heart died\nThen you gotta go and tell your girl and report that\nMain reason 'cause your pastor said you can't abort that\nNow your driver say that new Benz you can't afford that\nAll that cocaine on the table you can't snort that\nThat goin' to that owin' money that the court got\nAll in on that alimony, uh, yeah-yeah, she got you homie, yeah\nTill death but do your part, uh, unholy matrimony\n\n\nBlack bodies hangin' in the summer breeze, breeze\nStrange fruit hangin' from the poplar trees\nStrange fruit hangin' from the poplar trees\n\n\nThat summer night holdin' long and long (Breeze), 'din long (Breeze)\nNow waiting (Blood on the leaves) for the summer rose and (Breeze)\nAnd breathe and breathe (Blood on the leaves)\nAnd breathe and breathe (Breeze, breeze)\nAnd breathe and breathe (Black bodies hangin' in the summer breeze)\nAnd live and learn (Breeze)\nAnd live and learn (Strange fruit hangin' from the poplar trees)\nAnd livin' and livin' like I'm lonely, lonely, lonely (From the poplar trees, from the poplar trees)\nAnd livin' all I have\nAnd livin' all (Breeze, breeze)\nAnd live (Blood on the leaves)\nAnd live (Breeze, breeze)\n(Blood on the leaves)\n(Breeze, breeze)",
    "title": "blood_on_the_leaves"
}, {
    "album": "yeezus",
    "lyrics": "I need to call it off\nI need to, I need to make it known\n'Nother one\n\nSomething gone, capricorn\nDancing out on the lawn\nFancy like the things she likes\nShe lives her life\nI'm living mine\n\n\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, sof-sof-softer sof-softer ('Nother one)\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, softer than clay\n\n\nMaybe it's 'cause she into Leos and I was into trios\nPlus all the trips to Rio couldn't have helped\nIt's gettin' cold, better bring your ski clothes\nPeekin' through the keyhole, the door locked by myself\nAnd I'm feelin' it right now\n'Cause it's the time when my heart got shot down\nBlocka, blocka, blocka-blocka, blocka\nPour a little champagne, cranberry vodka\nFeelin' lied to like parents never say you adopted\nYour feelings like Zulu, then nothing is a Shaka\nI hit her with Jamaican dick, I'm the new Shabba\nShe lookin' for her daddy, call me Big Poppa\nOn to the next saga\nFocus on the future and let the crew knock her\nStar Wars fur, yeah, I'm rockin' Chewbacca\nThe one Chief Rocka, number one Chief Rocka, oh\n\n\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, sof-sof-softer sof-softer\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, softer than clay\n\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, sof-sof-softer sof-softer\nNone ah dem have the guts to rise it and spray\nNone ah dem have the guts to bust the SK\n\n\nOh, oh, oh\nIf you love me so much then why'd you let me go?\nIf you love me so much then why'd you let me go?\nIf you love me so much then why'd you let me go?\nLet me go, let me go\nLet me go\n\nIf you love me so much then why'd you let me go?\nLet me go\n\n\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, sof-sof-softer sof-softer\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, softer than clay\n\nAll dem a gwaan dem a dem a dem a gwaan\nDem a gwaan gwaan gwaan, sof-sof-softer sof-softer\nNone ah dem have the guts to rise it and spray\nNone ah dem have the guts to bust the SK",
    "title": "guilt_trip"
}, {
    "album": "yeezus",
    "lyrics": "Relivin' the past?\nHahahaha\nYour loss\n\n\nRockstar bitch call me Elvis\nM.O.B, she call me selfish\nSuccess got 'em jealous\nShorty's killin', while I'm drillin'\nTattoos, how they break the news\nIt was real if you made the news\nLast night my bitches came in twos\nAnd they both sucked like they came to lose\nDropped out the first day of school\n'Cause niggas got cocaine to move\nI be goin' hard, I got a name to prove\nKillin' 'em, honey how I make the pain improve\n\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\n\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\n\n\nThis the greatest shit in the club\nSince \"In da Club\"\nIt's so packed I might ride around\nOn my bodyguard's back like Prince in the club\nShe say, \"Can you get my friends in the club?\"\nI say, \"Can you get my Benz in the club?\"\nIf not, treat your friends like my Benz\nPark they ass outside 'til the evenin' end\nWhen I go raw, I like to leave it in\nWhen I wake up, I like to go again\nWhen I go to work, she gotta call it in\nShe can't go to work, same clothes again\nAnd her heart colder than the souls of men\nLouboutin on the toes again\nTight dress dancin' close to him\nYeezus just rose again\n\n\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\nWe can send this bitch up, it can't go down\n\n\nMemories don't live like people do\nThey always 'member you\nWhether things are good or bad\nIt's just the memories that you have\nMemories don't live like people do\nThey always 'member you\nWhether things are good or bad\nIt's just the memories that you have",
    "title": "send_it_up"
}, {
    "album": "yeezus",
    "lyrics": "B-b-b-b-bound to fall in love\nBound to fall in love\n\n\n\nAll them other niggas lame and you know it now\nWhen a real nigga hold you down, you supposed to drown\n\n\nBound \n Bound \n\n\nWhat you doin' in the club on a Thursday?\nShe say she only here for her girl birthday\nThey ordered champagne but still look thirsty\nRock Forever 21 but just turned thirty\n\nI know I got a bad reputation\nWalking-'round-always-mad reputation\nLeave-a-pretty-girl-sad reputation\nStart-a-Fight-Club-Brad reputation\n\nI turnt the nightclub out of the basement\nI'll turn the plane 'round, your ass keep complainin'\nHow you gon' be mad on vacation?\nDutty wining 'round all these Jamaicans\n\nUh, this that prom shit\nThis that what-we-do-don't-tell-your-mom shit\nThis that red-cup-all-on-the-lawn shit\nGot a fresh cut, straight out the salon, bitch\n\n\nI know you're tired of lovin', of lovin'\nWith nobody to love, nobody, nobody\n\n\n\nClose your eyes and let the word paint a thousand pictures\nOne good girl is worth a thousand bitches\n\n\nBound  Bound \n\n\nI wanna fuck you hard on the sink\nAfter that, give you somethin' to drink\nStep back, can't get spunk on the mink\nI mean damn, what would Jeromey Romey Romey Rome think?\n\nHey, you remember where we first met?\nOkay, I don't remember where we first met\nBut hey, admittin' is the first step\nAnd hey, you know ain't nobody perfect\n\nAnd I know, with the hoes I got the worst rep\nBut hey, their backstroke I'm tryna perfect\nAnd hey, ayo, we made it: Thanksgivin'\nSo hey, maybe we can make it to Christmas\n\nShe asked me what I wished for on my wishlist\nHave you ever asked your bitch for other bitches?\nMaybe we could still make it to the church steps\nBut first, you gon' remember how to forget\nAfter all these long-ass verses\nI'm tired, you tired, Jesus wept\n\n\nI know you're tired of lovin', of lovin'\nWith nobody to love, nobody, nobody\nSo just grab somebody, no leavin' this party\nWith nobody to love, nobody, nobody\n\n\n\nJerome's in the house, watch your mouth\nJerome's in the house, watch your mouth\n\n\nBound  Bound",
    "title": "bound_2"
}]
